[
    {
        "_id": "642337a1666192eb64ad23f0",
        "title": "Philips Audio Tws Tat1215 Bluetooth Truly Wireless In Ear Earbuds With Mic With 18 Hr Playtime - 6+12, Ipx4, Voice Assistant (Black)",
        "brand": "Philips Audio",
        "description": "Philips Audio Tws Tat1215 Bluetooth Truly Wireless In Ear Earbuds With Mic With 18 Hr Playtime - 6+12, Ipx4, Voice Assistant (Black)",
        "price": 4999,
        "discount": 62,
        "inStock": true,
        "soldBy": "GoodLuck Shoppie and Fulfilled by Amazon.",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41JjWA1nbPL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/41hmCqDETVL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81gCXp0kxjL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81+Qhr2-VZL._SX425_.jpg"
        ],
        "rating": {
            "rating": 4.5,
            "count": 7
        },
        "features": [
            "Total 18 hours play time (6 hours on single charge), 2 hours charging time",
            "Built-in mic with echo cancellation for clear audio",
            "Secure, comfortable fit",
            "Earbud switches to control music, calls, and volume",
            "6 mm Neodymium drivers. Clear sound, punchy bass"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423a55bd0601bdc0ef10bb1",
        "title": "(Renewed) Philips Audio TAT1225BL/94 Bluetooth Truly Wireless In Ear Earbuds with Mic (Blue)",
        "brand": "Philips Audio",
        "description": "This Certified Refurbished product is tested to work and look like new with minimal to no signs of wear & tear; the product comes with relevant accessories and is backed by a minimum six month supplier backed warranty; box may be generic Built-in mic with echo cancellation for clear audio Smart pairing. Automatically find your Bluetooth device Earbud switches to control music and calls Easily wake your phone's voice assistant",
        "price": 1399,
        "discount": 15,
        "inStock": true,
        "soldBy": "Umath Store and Fulfilled by Amazon.",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51AYuSgZiQL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/71P18toZKwL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/715CuNvY2gL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/71SQRlm6ufL._SY355_.jpg"
        ],
        "rating": {
            "rating": 3.3,
            "count": 133
        },
        "features": [
            "Renewed, professionally cleaned and restored to original condition",
            "Truly wireless design, no cords or wires",
            "Bluetooth connectivity to your device",
            "Built-in microphone for hands-free calling",
            "Compact and lightweight for comfortable wear",
            "Battery life of up to 3.5 hours per charge",
            "Charging case provides up to 10 hours of additional playtime",
            "LED battery indicator on charging case",
            "6mm drivers for clear, high-quality sound with deep bass",
            "Touch controls for easy playback and volume adjustment"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423a7d9d0601bdc0ef10bb3",
        "title": "Philips Audio TAN1207BK Bluetooth in-Ear Earphones with ENC Mic for Clear Calls, 12mm Drivers| Magnetic Ear-Tips for Tangle Free Experience, 15 Hr Play Time, IPX4 Sweatproof, Wireless Neckband(Black)",
        "brand": "Philips Audio",
        "description": "BLUETOOTH 5.0: The latest Bluetooth 5.0 offers enhanced sound transmission, faster pairing, more stable wireless connection and wider compatibility with Bluetooth enabled cell phones, tablets, computers, smart watches and smart speakers. IPX4 WATERPROOF: Designed for your active lifestyle. These earplugs are IPX4 and can withstand sweating. The ergonomic design provides the ultimate comfort for your active lifestyle, such as running, jogging, cycling, driving, camping, hiking, fitness and other outdoor sports.",
        "price": 1249,
        "discount": 52,
        "inStock": true,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/513lfS-K7ZL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/814AI9VPnlL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/71U24A2PhnL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/91BnLaQwfZL._SX425_.jpg"
        ],
        "rating": {
            "rating": 2.3,
            "count": 7
        },
        "features": [
            "Bluetooth connectivity to your device",
            "ENC mic for clear calls",
            "12mm drivers for powerful, clear sound",
            "Magnetic ear-tips for tangle-free storage",
            "15 hours of play time on a single charge",
            "IPX4 sweatproof rating for use during workouts",
            "Wireless neckband for comfortable wear",
            "Easy access controls for music and calls",
            "Voice assistant support for hands-free convenience",
            "Multiple size ear-tips included for a customizable fit"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423aa33d0601bdc0ef10bb5",
        "title": "Philips Audio Shb1805 Bluetooth Wireless In Ear Earphones With Mic With 10 Mm Drivers, Magnetic Ear Tips, Tangle Proof Cable, 4 Hr Play Time (Black)",
        "brand": "Philips Audio",
        "description": "The Philips Audio SHB1805 Bluetooth Wireless In Ear Earphones with Mic are a convenient and stylish option for those on-the-go. Featuring 10mm drivers, these earphones deliver powerful and clear sound. The magnetic ear tips help prevent tangling and the tangle-proof cable makes it easy to store them. With up to 4 hours of play time on a single charge, these earphones are perfect for your daily commute or workout. The built-in microphone allows for hands-free calling and the Bluetooth connectivity provides wireless freedom. These earphones also come in a sleek black color.",
        "price": 1090,
        "discount": 52,
        "inStock": true,
        "soldBy": "DEALS AMAZING",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/312eSoMLUzL._SX300_SY300_QL70_FMwebp_.jpg",
            "https://m.media-amazon.com/images/I/61Ubvz-sfjL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/51kWOxcapVL._SY550_.jpg",
            "https://m.media-amazon.com/images/I/61YGxLcganL._SX425_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 38
        },
        "features": [
            "Magnetic eartips: it makes it easier for you to carry your earphones without any hassle",
            "Contact us for warranty",
            "Clear sound: high-power 10 mm drivers are tuned to reproduce clear, crisp sound",
            "Ergonomic earbuds: earbuds are designed ergonomically for a comfortable, secure fit",
            "Support Bluetooth wireles"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423abf7d0601bdc0ef10bb7",
        "title": "Philips Audio TAN4207BK Bluetooth In-ear Earphones With ENC Mic for Clear Calls, 10mm Drivers| Magnetic Ear Tips for Tangle Free Experience, 20 Hr Play Time, IPX5 Sweatproof, Wireless Neckband (Black)",
        "brand": "Philips Audio",
        "description": "These earphones deliver powerful and clear sound. The ENC mic ensures clear call quality and the magnetic ear tips prevent tangling for easy storage. With up to 20 hours of play time on a single charge, these earphones are perfect for long listening sessions or workouts. They are also sweatproof with an IPX5 rating, making them ideal for outdoor use. The wireless neckband provides comfortable wear and easy access controls for music and calls",
        "price": 2078,
        "discount": 40,
        "inStock": true,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51M2R8TEm+L._SY550_.jpg",
            "https://m.media-amazon.com/images/I/61Ad1clM15L._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81vd1zFumgL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/71Q7cZRQ-QL._SX425_.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 88
        },
        "features": [
            "BLUETOOTH 5.0: The latest Bluetooth 5.0 offers enhanced sound transmission, faster pairing, more stable wireless connection and wider compatibility with Bluetooth enabled cell phones, tablets, computers, smart watches and smart speakers.",
            "IPX5 WATERPROOF: Designed for your active lifestyle. These earplugs are IPX5 and can withstand sweating. The ergonomic design provides the ultimate comfort for your active lifestyle, such as running, jogging, cycling, driving, camping, hiking, fitness and other outdoor sports.",
            "PLAY TIME: With 20 hours of play time, you will have enough power to keep your music going all day, no matter how busy it gets. A quick 15-minute charge will keep the music playing for 1 hour.",
            "ULTRA LIGHTWEIGHT: Free from wires that hold you down. These wireless headphones are so slim and light that you barely feel them in your ears.",
            "VOICE ASSISTANT: Activate Voice Assistant with just a press of the button and make your life easier. Check weather, news, latest cricket scores, manage calls, music or get any information easily and quickly."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423afd5d0601bdc0ef10bb9",
        "title": "Boult Audio Anchor Bluetooth Wireless Over Ear Headphones with Mic, Active Noise Cancellation, 30H Playtime, AUX Option, Balanced Audio 40mm Drivers, Voice Assistant Sweatproof Gaming ANC Headphones",
        "brand": "Boult Audio",
        "description": "audio experience with their balanced audio 40mm drivers. With active noise cancellation (ANC), these headphones eliminate unwanted background noise for a truly immersive audio experience. They come with a built-in microphone for hands-free calling and support voice assistant for added convenience. The headphones also offer up to 30 hours of playtime on a single charge and have an AUX option for wired use. These headphones are sweatproof, making them perfect for use during workouts and other physical activities. They are also designed with gaming in mind, providing clear audio for an enhanced gaming experience. Overall, the Boult Audio Anchor headphones offer a comfortable and high-quality audio experience with advanced features like ANC and voice assistant support.",
        "price": 4380,
        "discount": 30,
        "inStock": true,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/715jcYvT9pL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81S1nKrMm1L._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81hV2TAzpRL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81hV2TAzpRL._SX425_.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 88
        },
        "features": [
            "Active Noise Cancellation - Anchor's active noise cancellation allows you to have a better listening experience and focus on what really matters.",
            "30 Hours Playtime - Enjoy an extended listening time with your favorite tracks on repeat with Anchor that boasts of up to 30 hours of playtime.",
            "Mammoth 40mm drivers - Have an exhilarating audio experience with deep, dynamic bass from the 40mm drivers",
            "Gaming Mode - Enjoy a low latency gaming experience with the Game Mode on. With the provision of AUX connectivity, have an even better gaming experience with ANC and ultra-low latency.",
            "Comfort Fit - Wear them for as long as you want. With the comfort fit design, you will barely feel them around your ears.",
            "Voice Assistant – With Anchor's Voice Assistance feature, you can summon Siri and Google Assistant at the touch of a button.",
            "IPX5 Water Resistance - Sweat and rain won't ruin your listening experience with Anchor's IPX5 Water Resistant tech.",
            "boult audio Anchor; earphones; boult audio; boult, boult audio headphones; wireless; wireless earphones; bluetooth; over ear; boult over ear; probass anchor; anchor; boult anchor, active noise cancellation; anc; over ear headphones"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423b283d0601bdc0ef10bbb",
        "title": "Boult Audio ProBass Ranger Over-Ear Wireless Bluetooth Headphones with Microphone, Headset with Long Battery Life",
        "brand": "Boult Audio",
        "description": "Boult Audio ProBass Ranger Over-Ear Wireless Bluetooth Headphones are a high-quality audio accessory that deliver clear and immersive sound with deep bass. Equipped with a built-in microphone, these headphones enable hands-free calling and voice assistant activation. With a long battery life, they provide extended hours of uninterrupted listening, making them ideal for long commutes or travel. The comfortable over-ear design and wireless connectivity make them a convenient and enjoyable choice for music lovers and audiophiles alike.",
        "price": 7999,
        "discount": 30,
        "inStock": true,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/81kwtHjr3BL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81n1oZQeHDL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81TZ5oJBgRL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/918ILXmXl2L._SX425_.jpg"
        ],
        "rating": {
            "rating": 4.2,
            "count": 98
        },
        "features": [
            "Extra Bass - Boult’s sound signature has been packed with extra punchy and deep bass with accentuates the warm midst and crystal clear sparky highs. Transmission Distance 20m. Driver Size 50 mm",
            "Comfort - Unparalleled Comfort and Portable design. With ergonomic design and ultra-soft ear cups, our Bluetooth headphones ensure all-day listening comfort. Enjoy your music on the go",
            "mainly focus on cancelling out lower frequency sounds like engines, aviation environment, trains, traffic noise etc, Experience 10 hrs of uninterrupted listening",
            "Voice command - Give instructions to Siri and Google voice command with a simple 2 seconds click on Boult headphone",
            "Long battery Life - Ranger is a powerhouse. The run time is 13 hours and it has 1-2 days of standby",
            "IPX5 water resistant- earbuds and charging case inner Nano-coating makes it possible to waterproof for 1 meters deep for 30 minutes.Ideal for sweating it out at the gym. Even Wash the earbuds and base",
            "Dual mode - Designed for flexibility, Boult Audio headphones comes with a quality Aux-cable to ensure uninterrupted playing even when you run out of battery"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423b564d0601bdc0ef10bbd",
        "title": "Boult Audio Z25 True Wireless in Ear Earbuds with 32H Playtime, 45ms Low Latency, Type-C Fast Charging (10=150Mins), Made in India, Zen ENC Mic, 13mm Bass Drivers, Bluetooth 5.3 Ear Buds (Sunset Grey)",
        "brand": "Boult Audio",
        "description": "The Boult Audio Z25 True Wireless Earbuds are a high-performance audio product with impressive features. These earbuds are designed to deliver an immersive audio experience with 13mm bass drivers that produce deep, powerful bass. The Zen ENC Mic technology ensures crystal clear communication during phone calls, and the 45ms low latency ensures that audio and video are perfectly synced for a seamless viewing experience. The earbuds also feature Bluetooth 5.3 connectivity and have a playtime of up to 32 hours on a single charge. Additionally, the Type-C fast charging feature ensures quick and efficient charging, while the sleek Sunset Grey design adds a touch of style to the earbuds. Made in India, the Boult Audio Z25 True Wireless Earbuds are a great choice for anyone looking for a reliable and high-quality audio product.",
        "price": 2999,
        "discount": 57,
        "inStock": false,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71aMYvWX5UL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81AfCLLyD-L._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81QnTO4hlIL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81gZjO+A3gL._SX425_.jpg"
        ],
        "rating": {
            "rating": 3.9,
            "count": 98
        },
        "features": [
            "32 hours of total playtime – Mammoth battery power makes the Z25 earbuds stop at nothing",
            "10 mins charge = 150 mins playtime. Lightning Boult Type-C fast charging makes this possible, getting your buds ready in no time.",
            "Zen Mode – The Environmental Noise Cancellation mode wards off unwanted noise, making your calls crystal clear.",
            "Low latency gaming – Have an uninterrupted gaming experience with no lags with Z25's 45ms Adaptive Low Latency Gaming 13mm mammoth BoomX tech drivers deliver deep, dynamic bass that adds the much-needed thrill to your entertainment."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423b6a6d0601bdc0ef10bbf",
        "title": "Boult Audio Z40 True Wireless in Ear Earbuds with 60H Playtime, Zen™ ENC Mic, Low Latency Gaming, Type-C Fast Charging, Made in India, 10mm Rich Bass Drivers, IPX5, Bluetooth 5.1 Ear Buds TWS (White)",
        "brand": "Boult Audio",
        "description": "The Boult Audio Z40 True Wireless Earbuds are a high-performance audio product with impressive features. These earbuds are designed to deliver an immersive audio experience with 13mm bass drivers that produce deep, powerful bass. The Zen ENC Mic technology ensures crystal clear communication during phone calls, and the 45ms low latency ensures that audio and video are perfectly synced for a seamless viewing experience. The earbuds also feature Bluetooth 5.3 connectivity and have a playtime of up to 32 hours on a single charge. Additionally, the Type-C fast charging feature ensures quick and efficient charging, while the sleek Sunset Grey design adds a touch of style to the earbuds. Made in India, the Boult Audio Z25 True Wireless Earbuds are a great choice for anyone looking for a reliable and high-quality audio product.",
        "price": 4999,
        "discount": 67,
        "inStock": true,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61I7ZE-blvL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/81mHag1ENbL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/71cdZK-kD1L._SX569_.jpg",
            "https://m.media-amazon.com/images/I/81cGL-pDOvL._SX569_.jpg"
        ],
        "rating": {
            "rating": 3.9,
            "count": 98
        },
        "features": [
            "60 hours of total playtime – Mammoth battery power makes the Z40 earbuds stop at nothing.",
            "10 mins charge = 100 mins playtime. Lightning Boult Type-C fast charging makes this possible, getting your buds ready in no time.",
            "Zen Mode – The Environmental Noise Cancellation mode wards off unwanted noise, making your calls crystal clear.",
            "Low latency gaming – Have an uninterrupted gaming experience with no lags",
            "10mm BoomX tech drivers deliver deep, dynamic bass that adds the much-needed thrill to your entertainment."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423b7ccd0601bdc0ef10bc1",
        "title": "Boult Newly Launched Ammo True Wireless In Ear Earbuds with 40ms Lowest Latency, 40H Playtime, ENC Mic, Made in India, 13mm Bass Drivers, Interactive LEDs, Type-C Fast Charging (10Min=150min) Ear Buds",
        "brand": "Boult Audio",
        "description": "Zen ENC Mic: The Zen ENC Mic eliminates all background noise and captures your voice with crystal clear clarity, ensuring seamless communication with your gaming buddies. The mic filters out background noise, ensuring that your voice is heard loud and clear.",
        "price": 4999,
        "discount": 72,
        "inStock": true,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/81hWpe10SzL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81W20XqGzTL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81WtJAGqEQL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81cebeIW3bL._SX425_.jpg"
        ],
        "rating": {
            "rating": 3.9,
            "count": 98
        },
        "features": [
            "40 Hours Playtime: With the Ammo Gaming Earbuds, you can play for up to 40 hours on a single charge. That's more than enough to power you through even the longest gaming sessions without having to recharge.",
            "40 ms Low Latency Gaming Mode: The 40 ms low latency gaming mode is perfect for gamers who demand the best performance from their gear. You'll experience lightning-fast response times that give you an edge over the competition, making Ammo Earbuds a must-have for serious gamers.",
            "Interactive LED Lights: Experience the thrill of gaming with interactive LED lights that glow in sync with the audio, giving you a surreal gaming experience. Whether you're exploring a dark dungeon or engaging in an intense battle, the LED lights will transport you to the game's world and make your gaming experience more enjoyable.",
            "Zen ENC Mic: The Zen ENC Mic eliminates all background noise and captures your voice with crystal clear clarity, ensuring seamless communication with your gaming buddies. The mic filters out background noise, ensuring that your voice is heard loud and clear.",
            "Type-C Fast Charging: With Ammo Gaming Earbuds' Type-C Fast Charging feature, you can enjoy up to 150 minutes of playtime with just 10 minutes of charging (Type-C).",
            "13mm Drivers: Experience rich, powerful, and immersive sound with Ammo Gaming Earbuds' 13mm drivers. Whether you're playing games, listening to music, or watching movies, these drivers make sure to deliver deep bass, clear treble, and balanced midrange, ensuring that every sound is reproduced accurately and faithfully.",
            "IPX5 Water Resistant: Whether you're gaming in the rain or sweating during an intense match, the earbuds' water-resistant design ensures that they can handle whatever you throw at them."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6423dca4ef1d1f6a7ef4346b",
        "title": "Kore K-18kg DM Combo 2 Home Gym and Fitness Kit",
        "brand": "Kore",
        "description": "The Kore K-18kg DM Combo 2 Home Gym and Fitness Kit is a comprehensive workout package designed for people who want to exercise and stay fit at home. The kit includes a variety of equipment that can be used to perform a wide range of exercises and workouts, including strength training, cardio, and flexibility exercises.",
        "price": 2880,
        "discount": 50,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71re8Z-6chL._AC_UL480_FMwebp_QL65_.jpg",
            "https://m.media-amazon.com/images/I/51kDsA3tZeL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51vhvZW-+EL._SS40_.jpg"
        ],
        "rating": {
            "rating": 3.3,
            "count": 37
        },
        "features": [
            "18kg of PVC weight (2.5 kg x 4=10kg + 2 kg x 4 = 8 kg) + 2 x 14 inch dumbbell rods + 100 percent pure leather gym gloves + 1 skipping rope + 1 hand gripper",
            "A combination of all gym equipment for the perfect workout",
            "It is highly durable and long lasting",
            "A perfect muscle builder",
            "In-Box Contents: 18kg of PVC Weight (2.5 kg x 4=10kg, 2 kg x 4 = 8 kg), 2 x 14 inch Dumbbell Rods, 100 Percent Pure Leather Gym Gloves, 1 Skipping Rope, 1 Hand Gripper"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423ddf4ef1d1f6a7ef4346d",
        "title": "Kore K-PVC 20Kg Combo 3 Leather Home Gym and Fitness Kit and K-Dm-2Kg-Combo 16 Dumbbells Kit Combo, Black",
        "brand": "Kore",
        "description": "The Kore K-PVC 20Kg Combo 3 Leather Home Gym and Fitness Kit is a versatile workout package that includes a range of equipment designed to help you perform a variety of exercises and workouts. The kit includes a 3ft curl bar, a 5ft straight bar, and two dumbbell rods, all made of high-quality steel for durability. The kit also comes with a total of 20kg of PVC weight plates that can be used to adjust the resistance of the equipment to suit your fitness level.",
        "price": 4670,
        "discount": 61,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41neYUU--SL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51kyYWvUMqL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41-+rud-s+L._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41WJZsc-WjL._SS40_.jpg"
        ],
        "rating": {
            "rating": 3.7,
            "count": 125
        },
        "features": [
            "20 kg of PVC weight (2 kg x 4 = 8kg + 3 kg x 4 = 12 kg)",
            "1 x 3 feet curl rod + 2 x 14 inch dumbbell rods",
            "100 percent pure leather gym gloves + 1 gym backpack + 1 skipping rope + 1 hand gripper + 2locks and clippers comes with the rods",
            "A combination of all gym equipment for the perfect workout",
            "2 kg x 2 PVC dumbbells",
            "A combination of gym equipment for the perfect workout",
            "Highly durable and long lasting",
            "A perfect muscle builder"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423df67ef1d1f6a7ef4346f",
        "title": "Kore PVC 30 Kg Combo2-Wb with One 5 Ft Plain + One 3 Ft Curl Rod and One Pair Dumbbell Rods with Gym Accessories Home Gym Set, Multicolour",
        "brand": "Kore",
        "description": "The Kore PVC 30 Kg Combo2-Wb with One 5 Ft Plain + One 3 Ft Curl Rod and One Pair Dumbbell Rods with Gym Accessories Home Gym Set is a complete workout package that includes a range of equipment designed to help you perform a variety of exercises and workouts. The kit includes a 5ft solid straight barbell, a 3ft curl barbell, and two dumbbell rods, all made of high-quality steel for durability.",
        "price": 2249,
        "discount": 0,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51o8LUBdmxL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51F2nNTtFlL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51r4bjlvZsL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51O+kc5wLML._SS40_.jpg"
        ],
        "rating": {
            "rating": 3.3,
            "count": 80
        },
        "features": [
            "30 Kg of PVC weight (2.5 Kg x 4 = 10 Kg + 5 Kg x 4 = 20Kg ))",
            "1 x 5 feet plain rod + 1 x 3 feet curl rod",
            "2 x 14 inch dumbbell Rods",
            "4 Locks and clippers comes with the rods",
            "A combination of all gym equipment for the perfect workout,It is highly durable and long lasting,A perfect muscle builder."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423e050ef1d1f6a7ef43471",
        "title": "Kore K-PVC-40KGCOMBO2-SL 40kg PVC Leather Combo 2 Home Gym ( Multicolour)",
        "brand": "Kore",
        "description": "The Kore K-PVC-40KGCOMBO2-SL 40kg PVC Leather Combo 2 Home Gym is a comprehensive workout kit designed to provide you with everything you need to stay fit and healthy. The kit includes a range of high-quality equipment made of durable PVC and leather materials, designed to help you perform a variety of exercises and workouts.",
        "price": 7760,
        "discount": 67,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/519HrHzL6uL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41tEJ6yUZzL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51r4bjlvZsL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51O+kc5wLML._SS40_.jpg"
        ],
        "rating": {
            "rating": 3.5,
            "count": 649
        },
        "features": [
            "40 kg of PVC weight ( 2 kg x 4 = 8Kg + 3 kg x 4 = 12 kg + 5 kg x 4 = 20Kg )",
            "1 x 5 feet plain rod + 1 x 3 feet curl rod + 2 x 14  dumbbell rods",
            "100 and percent leather gym gloves + 1 gym backpack + 1 skipping rope + 1 hand gripper + 4 locks and clippers comes with the rods",
            "A combination of all gym equipment's for the perfect workout",
            "It is highly durable",
            "In-box Contents: 40 kg of PVC weight ( 2 kg x 4 = 8Kg + 3 kg x 4 = 12 kg + 5 kg x 4 = 20Kg ), 1 x 5 feet plain rod + 1 x 3 feet curl rod + 2 x 14  dumbbell rods, 100% percent leather gym gloves + 1 Gym backpack + 1 Skipping Rope + 1 Hand Gripper + 4 locks and clippers comes with the rods"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423e128ef1d1f6a7ef43473",
        "title": "Kore PVC 10 Kg Combo 3 Wb-Wa Home Gym Set with One 3 Ft Curl Rod and One Pair Dumbbell Rods, Black",
        "brand": "Kore",
        "description": "The Kore PVC 10 Kg Combo 3 Wb-Wa Home Gym Set is a compact and versatile workout kit designed to help you get fit and stay healthy. The kit includes a range of high-quality equipment made of durable PVC materials, designed to help you perform a variety of exercises and workouts.",
        "price": 3090,
        "discount": 54,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/413s6GTRhVL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/31Upil962hL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51O+kc5wLML._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41ZaLZYI0PL._SS40_.jpg"
        ],
        "rating": {
            "rating": 3.4,
            "count": 224
        },
        "features": [
            "10 kg of PVC weight (2.5 kg x 4 = 10Kg )",
            "1 x 3 feet curl rod + 2 x 14 inch dumbbell rods",
            "2 locks and clippers comes with the rods",
            "A combination of all gym equipment for the perfect workout",
            "It is highly durable and Lasting",
            "A perfect muscle builder",
            "In-box Contents: In-Box Contents: 10 kg of PVC weight (2.5 kg x 4 = 10Kg ), 1 x 3 feet curl rod, 2 x 14 inch dumbbell rods"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423e264ef1d1f6a7ef43475",
        "title": "Lifelong PVC Hex Dumbbells Pack of 2 (2kg-10kg) for Home Gym Equipment Fitness Barbell|Gym Exercise|Home Workout, Gym Dumbbells|Dumbbells Weights for Men & Women (6 Months Warranty)",
        "brand": "Lifelong",
        "description": "The Lifelong PVC Hex Dumbbells Pack is a set of high-quality dumbbells designed for home gym equipment, fitness barbell, gym exercise, and home workout. The pack includes 2 dumbbells, each weighing between 2kg to 10kg, making them ideal for men and women of all fitness levels.",
        "price": 139,
        "discount": 7,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/31cHmJmg7mL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51hGP83kBqL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51ReWDtThCL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51+SRGoO5PL._SS40_.jpg"
        ],
        "rating": {
            "rating": 3.8,
            "count": 1576
        },
        "features": [
            "Set of 2 PVC hex dumbbells for resistance training; each dumbbell weighs 1 kg *2 total 2kg weight Made in India",
            "Ideal for fitness classes or at-home workout routines Easy to store as they do not occupy a lot of space Easy grip and anti slip",
            "These durable hand weights are the perfect addition to aerobics and step workouts, as well as any standard strength training with weights for added intensity and resistance",
            "6 month warranty for manufacturing defects."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423e2afd472849f6aedf880",
        "title": "Lenovo IdeaPad Slim 1 AMD Ryzen 3 3250U 15.6 (39.62cm) FHD Thin & Light Laptop (8GB/512GB SSD/Windows 11/Office 2021/3months Game Pass/Cloud Grey/1.6Kg) 82R10049IN",
        "brand": "Lenovo",
        "description": "The Lenovo IdeaPad Slim 1 is a powerful and lightweight laptop that is perfect for both personal and professional use. Powered by an AMD Ryzen 3 3250U processor, this laptop is capable of handling a wide range of tasks with ease. The 15.6 (39.62cm) FHD display ensures a clear and vibrant viewing experience, making it ideal for entertainment, work, and gaming. With 8GB of RAM and a 512GB SSD,",
        "price": 54490,
        "discount": 32,
        "inStock": true,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71VB1UTcYkL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61H96HbSqTL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/71Cj3RJhqiL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61ubkDRg+QL._SX522_.jpg"
        ],
        "rating": {
            "rating": 4.9,
            "count": 28
        },
        "features": [
            "Processor: AMD Ryzen 3 3250U | Speed: 2.6 GHz (Base) - 3.5 GHz (Max) | 2 Cores | 4 Threads | 1MB L2 / 4MB L3",
            "OS and Software: Windows 11 Home 64 | Office Home and Student 2021 | Xbox GamePass Ultimate 3-month subscription*",
            "Display: 15.6 FHD (1920x1080) | Brightness : 220nits | Anti-Glare",
            "Design: 1.79 cm Thin and 1.6 kg Light | Narrow Bezel",
            "Battery Life: 42Wh | Upto 7.5 Hours battery life",
            "Camera (Built-in): HD 720p with Privacy Shutter || Audio: 2x 1.5W Stereo Speakers | HD Audio | Dolby Audio",
            "Ports: 1x USB-C 3.2 Gen 1 (support data transfer only) | 1x USB-A 3.2 Gen 1 | 1x USB-A 2.0 | 1x Headphone / microphone combo jack (3.5mm) | 1x HDMI 1.4b | 4-in-1 media reader (MMC, SD, SDHC, SDXC)",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Active subscription needed;continues until cancelled-game catalog varies. Needs Windows11 & app to play PC games; see-xbox.com/pcgamesplan. Discounts exclude titles within 30 days of launch; based on Microsoft Store price. See xbox.com/game-pass.",
            "Resolution: 1080p; Software Included: Windows 11 Home 64, English; Human Interface Input: Keyboard; Wireless Communication Technology: Wi-Fi"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423e38fef1d1f6a7ef43477",
        "title": "Lifelong Adjustable Hand Grip Strengthener|Adjustable Resistance (10kg-60kg)|Hand Gripper for Men & Women for Gym Workout Hand Exercise Equipment to Use in Home for Forearm Exercise, Finger Exercise Power Gripper (Red & Black, LLFAHG01)",
        "brand": "Lifelong",
        "description": "The Lifelong Adjustable Hand Grip Strengthener is a versatile hand gripper designed for men and women of all fitness levels. The hand gripper features adjustable resistance levels, ranging from 10kg to 60kg, making it ideal for both beginners and advanced users.",
        "price": 499,
        "discount": 64,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41oQcrDTDZL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41VehQ0+18L._SS40_.jpg",
            "https://m.media-amazon.com/images/I/518UCEIIhuL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51AN01pDNzL._SS40_.jpg"
        ],
        "rating": {
            "rating": 3.5,
            "count": 243
        },
        "features": [
            "Improved Finger Strength: Lifelong Hand grip strengthener is ideal for improving the strength of fingers Compact & Durable: Hand Grip Exerciser is compact and Durable. It is light weight and a perfect fit for your pocket.",
            "Improved Hand Endurance: Hand and Fingers exerciser which Develop hand endurance and coordination skills.",
            "Rotation Adjustment: You can adjust the resistance by simply by rotating the knob.",
            "Problems like hand fatigue can be resolved by producing some finger-relaxing movements, such as gripping and pinching, to improve blood circulation.",
            "Perfect Exercise Device for strengthening the wrist, fingers and forearm muscles."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423e4adef1d1f6a7ef43479",
        "title": "Lifelong Neoprene Cast Iron Light Heavy Dumbbells Weights Fitness Home Gym Exercise Barbell for Women and Men (Black, 4kg x 2) - Set of 2",
        "brand": "Lifelong",
        "description": "The Lifelong Neoprene Cast Iron Light Heavy Dumbbells are a great addition to any home gym equipment collection. The set comes with two dumbbells, each weighing 4kg, making it perfect for women and men who want to start or continue their strength training.",
        "price": 5200,
        "discount": 60,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/31vE+z7etwL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/5155aMX4M-L._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41Aa1SHbqCL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41JIHaxjszL._SS40_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 48
        },
        "features": [
            "Set of 2 dumbbells for resistance training; each dumbbell weighs 2 kgs",
            "Easy-grip high neoprene cast iron dumbbells for a secure hold",
            "Ideal for fitness classes or at-home workout routines",
            "Easy to store as they do not occupy a lot of space",
            "Dumbbells can be used to perform a multitude of exercises targeting muscle groups throughout the entire body including the chest, back, arms, and legs",
            "These durable hand weights are the perfect addition to aerobics and step workouts, as well as any standard strength training with weights for added intensity and resistance",
            "Material: Other",
            "In-box Contents: 2 Dumbbells",
            "6 month warranty for manufacturing defects."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423e59e447e348910779059",
        "title": "Lenovo IdeaPad Slim 3 Intel Celeron N4020 4th Gen 15.6 (39.62cm) HD Thin & Light Laptop (8GB/256GB SSD/Windows 11/Office 2021/2Yr Warranty/3months Game Pass/Platinum Grey/1.7Kg), 81WQ00MQIN",
        "brand": "Lenovo",
        "description": "The Lenovo IdeaPad Slim 3 is a powerful and lightweight laptop that is perfect for both personal and professional use. Powered by an AMD Ryzen 3 3250U processor, this laptop is capable of handling a wide range of tasks with ease. The 15.6 (39.62cm) FHD display ensures a clear and vibrant viewing experience, making it ideal for entertainment, work, and gaming. With 8GB of RAM and a 512GB SSD,",
        "price": 40490,
        "discount": 32,
        "inStock": true,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61Dw5Z8LzJL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61NJJEoyHNL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61ZDeDna6wL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/51wQs0x5SzL._SX522_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 28
        },
        "features": [
            "Processor: AMD Ryzen 3 3250U | Speed: 2.6 GHz (Base) - 3.5 GHz (Max) | 2 Cores | 4 Threads | 1MB L2 / 4MB L3",
            "OS and Software: Windows 11 Home 64 | Office Home and Student 2021 | Xbox GamePass Ultimate 3-month subscription*",
            "Display: 15.6 FHD (1920x1080) | Brightness : 220nits | Anti-Glare",
            "Design: 1.79 cm Thin and 1.6 kg Light | Narrow Bezel",
            "Battery Life: 42Wh | Upto 7.5 Hours battery life",
            "Camera (Built-in): HD 720p with Privacy Shutter || Audio: 2x 1.5W Stereo Speakers | HD Audio | Dolby Audio",
            "Ports: 1x USB-C 3.2 Gen 1 (support data transfer only) | 1x USB-A 3.2 Gen 1 | 1x USB-A 2.0 | 1x Headphone / microphone combo jack (3.5mm) | 1x HDMI 1.4b | 4-in-1 media reader (MMC, SD, SDHC, SDXC)",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Active subscription needed;continues until cancelled-game catalog varies. Needs Windows11 & app to play PC games; see-xbox.com/pcgamesplan. Discounts exclude titles within 30 days of launch; based on Microsoft Store price. See xbox.com/game-pass.",
            "Resolution: 1080p; Software Included: Windows 11 Home 64, English; Human Interface Input: Keyboard; Wireless Communication Technology: Wi-Fi"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423e5ecef1d1f6a7ef4347b",
        "title": "Lifelong PVC Fixed Dumbbells Pack of 2 for Home Gym Equipment Fitness Barbell|Home Workout, Gym Dumbbells|Easy Grip & Anti- Slip Dumbbells|Dumbbells Weights for Men & Women (6 Months Warranty)",
        "brand": "Lifelong",
        "description": "The Lifelong PVC Fixed Dumbbells Pack of 2 is a great option for those who want to incorporate strength training into their home gym workouts. The set comes with two dumbbells, each weighing the same amount.",
        "price": 599,
        "discount": 53,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41Qkx0hcmBL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41hrtmZqpgL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41RWZDyQOOL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41kHQdgVZ+L._SS40_.jpg"
        ],
        "rating": {
            "rating": 3.9,
            "count": 4721
        },
        "features": [
            "Set of 4 PVC dumbbells for resistance training; each dumbbell weighs 2 kg *2 total 4kg weight Made in India",
            "Ideal for fitness classes or at-home workout routines Easy to store as they do not occupy a lot of space",
            "Easy grip and anti slip",
            "These durable hand weights are the perfect addition to aerobics and step workouts, as well as any standard strength training with weights for added intensity and resistance",
            "6 month warranty for manufacturing defects."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423e70fef1d1f6a7ef4347d",
        "title": "Lifelong PVC 20kg Plate Home Gym Set (Black, 10Kg Hex Dumbbell)",
        "brand": "Lifelong",
        "description": "The Lifelong PVC 20kg Plate Home Gym Set is a great option for those looking to start a home gym or add to their existing collection. The set includes one 10kg hex dumbbell and four 2.5kg PVC weight plates",
        "price": 8000,
        "discount": 55,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41l81HfjGfL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41Nuv+PIHEL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41VWSjBxdEL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/419NLB455sL._SS40_.jpg"
        ],
        "rating": {
            "rating": 3.9,
            "count": 15
        },
        "features": [
            "One dumbbell for resistance training; Weighs 10Kgs",
            "6 month warranty for manufacturing defects.",
            "Easy-grip rubber cast iron dumbbells a secure hold",
            "Hexagonal shape prevents dumbbell from rolling away",
            "Ideal for fitness classes or at-home workout routines",
            "Easy to store as they do not occupy a lot of space",
            "Dumbbells can be used to perform a multitude of exercises targeting muscle groups throughout the entire body including the chest, back, arms, and legs"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Strength Training"
    },
    {
        "_id": "6423e741447e34891077905b",
        "title": "Lenovo Ideapad 3 AMD Ryzen 5 5500U 15.6 (39.62cm) FHD Thin & Light Laptop (8GB/512GB SSD/Windows 11/Office 2021/Backlit Keyboard/2Yr Warranty/Arctic Grey/1.65Kg), 82KU017KIN",
        "brand": "Lenovo",
        "description": "Ports: 1x USB-A 3.2 Gen 1 | 1x USB-A 2.0 | 1x USB-C 3.2 Gen 1 (Data transfer) | 1x 3.5mm Headphone/Mic combo jack | 1x HDMI 1.4b | 1x 4-in-1 media reader (MMC, SD, SDHC, SDXC) Battery Life: 45Wh | Upto 7 Hours | Rapid Charge (Up to 80% in 1 Hour)",
        "price": 68490,
        "discount": 35,
        "inStock": true,
        "soldBy": "Appario Retail Private Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61q6x-ll5FL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/617eM1hqoPL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/716mHZD9Q6L._SX522_.jpg",
            "https://m.media-amazon.com/images/I/81KjybcLD-L._SX522_.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 18
        },
        "features": [
            "Processor: 5th Gen AMD Ryzen 5 5500U | Speed: 2.1 GHz (Base) - 4.0 GHz (Max) | 6 Cores | 12 Threads | 3MB L2 & 8MB L3 Cache",
            "OS: Pre-Loaded Windows 11 Home with Lifetime Validity | Pre-Installed: MS Office Home and Student 2021",
            "Display: 15.6 FHD (1920x1080) | Brightness : 220nits | Anti-Glare",
            "Design: 1.79 cm Thin and 1.6 kg Light | Narrow Bezel",
            "Battery Life: 42Wh | Upto 7.5 Hours battery life",
            "Camera (Built-in): HD 720p with Privacy Shutter || Audio: 2x 1.5W Stereo Speakers | HD Audio | Dolby Audio",
            "Ports: 1x USB-C 3.2 Gen 1 (support data transfer only) | 1x USB-A 3.2 Gen 1 | 1x USB-A 2.0 | 1x Headphone / microphone combo jack (3.5mm) | 1x HDMI 1.4b | 4-in-1 media reader (MMC, SD, SDHC, SDXC)",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Active subscription needed;continues until cancelled-game catalog varies. Needs Windows11 & app to play PC games; see-xbox.com/pcgamesplan. Discounts exclude titles within 30 days of launch; based on Microsoft Store price. See xbox.com/game-pass.",
            "Resolution: 1080p; Software Included: Windows 11 Home 64, English; Human Interface Input: Keyboard; Wireless Communication Technology: Wi-Fi"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423e8d2ef1d1f6a7ef4347f",
        "title": "PowerMax Fitness TDM-9x Series - Light, Foldable, Electric Treadmill【LCD Display | BMI 】 Running Machine for Max Pro-Workout by Walk, Run & Jog at Home",
        "brand": "PowerMax Fitness",
        "description": "PowerMax Fitness TDM-9x Series - Light, Foldable, Electric Treadmill【LCD Display | BMI 】 Running Machine for Max Pro-Workout by Walk, Run & Jog at Home.",
        "price": 44500,
        "discount": 63,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/4194tDM5XTL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51Ru2mL+QkL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/411rBZn3IBL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41eZGzjCDwL._SS40_.jpg"
        ],
        "rating": {
            "rating": 4.4,
            "count": 5189
        },
        "features": [
            " Lifetime Frame Warranty, 3-Year Motor Warranty, and 1-Year Parts and Labour Warranty",
            "1.75HP DC Motor, Max User Weight: 100KG and Running Surface: 43.3 x 15.7inches / 1100 x 400mm",
            "Speed: 1.0 - 10.0km/hr and 14cm LED Display - Time, Speed, Distance, Calories & Heart rate",
            "12 Pre-set workout & 3 target based modes, Heart Rate Sensor",
            "Wheels for Transportation"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "6423e8da447e34891077905d",
        "title": "Lenovo IdeaPad Slim 3 Intel Core i3 11th Gen 14 (35.56cm) FHD Thin & Light Laptop (8GB/512GB SSD/Windows 11/Office 2021/2Yr Warranty/3months Game Pass/Arctic Grey/1.41Kg), 82H701DNIN",
        "brand": "Lenovo",
        "description": "Camera: HD 720p Camera | Fixed Focus | Privacy Shutter | Integrated Dual Array Microphone || Audio: 2x 1.5W Stereo Speakers | HD Audio | Dolby Audio",
        "price": 61490,
        "discount": 34,
        "inStock": true,
        "soldBy": "LOWEST PRICE SHOP",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61H5Q84fQYS._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61zWO5vbwJL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61AIJfjGmxL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/71ogw1dovTS._SX522_.jpg"
        ],
        "rating": {
            "rating": 3.7,
            "count": 88
        },
        "features": [
            "Processor: 11th Gen Intel Core i3-1115G4 | Speed: 3.0 GHz (Base) - 4.1 GHz (Max) | 2 Cores | 4 Threads | 6MB Cache",
            "Display: 14 FHD (1920x1080) | TN | 250Nits Brightness | Anti Glare | 45% NTSC",
            "Graphics: Integrated Intel UHD Graphics | Memory: 8GB RAM DDR4-3200, upgradable Up to 12GB | Storage: 512 GB SSD",
            "Battery Life: 42Wh | Upto 7.5 Hours battery life",
            "OS & Software: Windows 11 Home 64 | Office Home & Student 2021 | Xbox GamePass Ultimate 3-month subscription*",
            "Ports: 1x USB-C 3.2 Gen 1 (support data transfer only) | 1x USB-A 3.2 Gen 1 | 1x USB-A 2.0 | 1x Headphone / microphone combo jack (3.5mm) | 1x HDMI 1.4b | 4-in-1 media reader (MMC, SD, SDHC, SDXC)",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Active subscription needed;continues until cancelled-game catalog varies. Needs Windows11 & app to play PC games; see-xbox.com/pcgamesplan. Discounts exclude titles within 30 days of launch; based on Microsoft Store price. See xbox.com/game-pass.",
            "Resolution: 1080p; Software Included: Windows 11 Home 64, English; Human Interface Input: Keyboard; Wireless Communication Technology: Wi-Fi"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423e9bfef1d1f6a7ef43481",
        "title": "PowerMax Fitness TD-M1-A1 Series - Light, Foldable, Electric Treadmill【100% Pre-Installed】 Running Machine for Max Pro-Workout by Walk, Run & Jog at Home",
        "brand": "PowerMax Fitness",
        "description": "Tracking your progress is simple with the 10cm LCD Display screen. Displaying your speed, time, distance, calories, and pulse with 12 Built-in workout programs, you will be able to see your results to keep you motivated and on pace.",
        "price": 62480,
        "discount": 60,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/411YWCkhhyL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51vmc1kMbIS._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41oXMRHsWnS._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41k-6TnK4gS._SS40_.jpg"
        ],
        "rating": {
            "rating": 4.4,
            "count": 4256
        },
        "features": [
            "Lifetime Frame Warranty, 3-Year Motor Warranty, and 1-Year Parts and Labour Warranty",
            "2.0HP DC Motor, Max User Weight: 90KG and Running Surface: 47.6 x 16.1inches / 1210 x 410mm",
            "2 Level Manual Incline, Speed: 1.0 - 14.0km/hr and 10cm LCD Display - Time, Speed, Distance, Heart rate, Calories, Program",
            "12 Pre-set Programs for efficient workout & 3 Target based Modes, Heart Rate Sensor and Semi-Auto Lubrication",
            "Wheels for Transportation"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "6423ea6d447e34891077905f",
        "title": "Lenovo IdeaPad Gaming 3 Intel Core i5 11th Gen 15.6 (39.62cm) FHD IPS Gaming Laptop (8GB/512GB SSD/4GB NVIDIA GTX 1650/120Hz/Win 11/Backlit/3months Game Pass/Shadow Black/2.25Kg), 82K10198IN",
        "brand": "Lenovo",
        "description": "Military Grade : MIL-STD-810G Qualified Design| Qualified for various Military Specification Tests like Low & High Temp (-25 to 63°C for 4 hrs) | Temp Shock (-25 to 63°C one way temp Shock)| Shock (122cm+ Drop Test) | Vibration (4-32Hz over 2 hrs)",
        "price": 82490,
        "discount": 38,
        "inStock": true,
        "soldBy": "LOWEST PRICE SHOP",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71--IQUHVwL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61-dlLEXhAL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/71J41qcf0YL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61YBRFyS3oL._SX522_.jpg"
        ],
        "rating": {
            "rating": 2.7,
            "count": 88
        },
        "features": [
            "Audio: 2x 2W HD Stereo Speakers | Nahimic Audio with Surround Sound, Sound Tracker, Night Mode, Sound Sharing & Content Profiles || Camera: HD 720p with E-camera Shutter | Physical kill switch for 100% privacy protection | Integrated Dual Array Mic",
            "Display: 14 FHD (1920x1080) | TN | 250Nits Brightness | Anti Glare | 45% NTSC",
            "Graphics: Integrated Intel UHD Graphics | Memory: 8GB RAM DDR4-3200, upgradable Up to 12GB | Storage: 512 GB SSD",
            "Battery Life: 42Wh | Upto 7.5 Hours battery life",
            "OS & Software: Windows 11 Home 64 | Office Home & Student 2021 | Xbox GamePass Ultimate 3-month subscription*",
            "Ports: 1x USB-C 3.2 Gen 1 (support data transfer only) | 1x USB-A 3.2 Gen 1 | 1x USB-A 2.0 | 1x Headphone / microphone combo jack (3.5mm) | 1x HDMI 1.4b | 4-in-1 media reader (MMC, SD, SDHC, SDXC)",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Audio: 2x 2W HD Stereo Speakers | Nahimic Audio with Surround Sound, Sound Tracker, Night Mode, Sound Sharing & Content Profiles || Camera: HD 720p with E-camera Shutter | Physical kill switch for 100% privacy protection | Integrated Dual Array Mic",
            "Resolution: 1080p; Software Included: Windows 11 Home 64, English; Human Interface Input: Keyboard; Wireless Communication Technology: Wi-Fi"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423eaa3ef1d1f6a7ef43483",
        "title": "PowerMax Fitness TDM-100M (2.0HP) Motorized Foldable Electric Treadmill (Black)",
        "brand": "PowerMax Fitness",
        "description": "Powermax fitness strives to be the best in affordable fitness equipment that's offered on the market to both residential and commercial clients. Our mission is to make fitness available to everyone by combining good value and simplicity with the best designs, technologies, and services..",
        "price": 53000,
        "discount": 35,
        "inStock": true,
        "soldBy": " RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41h0-cHiMOL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51UYovS16OL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51aB3meJk6L._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51-kj90p2aL._SS40_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 1901
        },
        "features": [
            "Speed: 0.8 - 14.8km/hr. Running surface (L X W) – 1260 x 430mm / 49.6 x 16.9 inches",
            "Max User Weight: 105KG",
            "Colour: Black"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "6423eb68447e348910779061",
        "title": "Dell Vostro 3420 Laptop,12th Gen Intel Core i3-1215U, 8GB & 512GB SSD, 14.0 (35.56Cms)FHD WVA AG 250 nits, Win11+MSO'21, Carbon Black(D552325WIN9BE, 1.48 KGs), Additional Bank Discounts on All Banks",
        "brand": "Dell",
        "description": "Military Grade : MIL-STD-810G Qualified Design| Qualified for various Military Specification Tests like Low & High Temp (-25 to 63°C for 4 hrs) | Temp Shock (-25 to 63°C one way temp Shock)| Shock (122cm+ Drop Test) | Vibration (4-32Hz over 2 hrs)",
        "price": 62490,
        "discount": 32,
        "inStock": true,
        "soldBy": "Appario Retail Private",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51bqpP0jb5L._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61sYZ56b4cL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/51FBg6dRD-L._SX522_.jpg",
            "https://m.media-amazon.com/images/I/51L079X9bmL._SX522_.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 38
        },
        "features": [
            "Audio: 2x 2W HD Stereo Speakers | Nahimic Audio with Surround Sound, Sound Tracker, Night Mode, Sound Sharing & Content Profiles || Camera: HD 720p with E-camera Shutter | Physical kill switch for 100% privacy protection | Integrated Dual Array Mic",
            "Display: 14 FHD (1920x1080) | TN | 250Nits Brightness | Anti Glare | 45% NTSC",
            "Graphics: Integrated Intel UHD Graphics | Memory: 8GB RAM DDR4-3200, upgradable Up to 12GB | Storage: 512 GB SSD",
            "Battery Life: 42Wh | Upto 7.5 Hours battery life",
            "OS & Software: Windows 11 Home 64 | Office Home & Student 2021 | Xbox GamePass Ultimate 3-month subscription*",
            "Ports: 1x USB-C 3.2 Gen 1 (support data transfer only) | 1x USB-A 3.2 Gen 1 | 1x USB-A 2.0 | 1x Headphone / microphone combo jack (3.5mm) | 1x HDMI 1.4b | 4-in-1 media reader (MMC, SD, SDHC, SDXC)",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Audio: 2x 2W HD Stereo Speakers | Nahimic Audio with Surround Sound, Sound Tracker, Night Mode, Sound Sharing & Content Profiles || Camera: HD 720p with E-camera Shutter | Physical kill switch for 100% privacy protection | Integrated Dual Array Mic",
            "Resolution: 1080p; Software Included: Windows 11 Home 64, English; Human Interface Input: Keyboard; Wireless Communication Technology: Wi-Fi"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423eb9eef1d1f6a7ef43485",
        "title": "PowerMax Fitness BX-110SX Fitness Exercise Magnetic X Bike Cycle for Home, Weight Loss, Cherry Red",
        "brand": "PowerMax Fitness",
        "description": "The PowerMax Fitness BX-110SX is an exercise bike designed for home use. It features a magnetic resistance system, which allows for a smooth and quiet ride, and can help users achieve weight loss goals. The bike has a sturdy frame and can support users up to 110 kg.",
        "price": 32000,
        "discount": 59,
        "inStock": true,
        "soldBy": "Powermax Fitness India Pvt. Ltd.",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41jwDSKfA7L._SS40_.jpg",
            "https://m.media-amazon.com/images/I/41e5clqoXQL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51Ol0eSP7JL._SS40_.jpg",
            "https://m.media-amazon.com/images/I/51BcbhnEeIL._SS40_.jpg"
        ],
        "rating": {
            "rating": 4.4,
            "count": 699
        },
        "features": [
            "LCD Display - Speed, Time, Distance, Calories And Hand Pulse",
            "Flywheel System: 4KG Flywheel",
            "8-Level Training Intensity By Manual",
            "Ribbed Belt One-way Belt Drive System",
            "Max User Weight: 110KG",
            "Anti-Skid Pedals With Adjustable Foot Straps",
            "The Comfort Seat Provides Exceptional Comfort with Back Support and Vertical Adjustment"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "6423ed98447e348910779063",
        "title": "Dell Inspiron 3511 Laptop, Intel i3-1115G4, 8GB DDR4 & 512GB SSD, Windows 11 + MSO'21, 15.6 (39.62Cms) FHD WVA AG, Carbon Black (D560801WIN9B, 1.8Kgs)",
        "brand": "Dell",
        "description": "Main software that runs the laptop. Windows, Linux & DOS are popular ones. DOS requires separate installation of operating system before using the laptop",
        "price": 55490,
        "discount": 22,
        "inStock": true,
        "soldBy": "Appario Retail Private",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/6192pE7H2FL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61wnhsBV7BL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/51ltoYSqgqL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/51pMkWBAfwL._SX522_.jpg"
        ],
        "rating": {
            "rating": 4.2,
            "count": 198
        },
        "features": [
            "Processor: Intel i3-1115G4 (1.70 GHz & up to 4.10 GHz) 2 Cores, 6MB Cache",
            "RAM & Storage: 8GB, 8Gx1, DDR4, 3200MHz_2666MHz Ach & 512GB SSD",
            "Battery Life: 42Wh | Upto 7.5 Hours battery life",
            "Graphics & Keyboard: Integrated & Standard Keyboard",
            "Display: 15.6 FHD WVA AG Narrow Borde",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Ports: 2x USB 3.2 Gen1 ,1x USB 2.0, HDMI 1.4, SD Card reader, Audio jack, 1 M.2 2230/2280 slot for solid-state drive/Intel Optane",
            "WiFi & Bluetooth- 802.11ac 1x1 WiFi and Bluetooth"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423ee82447e348910779065",
        "title": "Dell Inspiron 14-inch 2-in-1 Laptop (35.56 cms) | Windows 11, MS Office 2021 | Intel i3-1215U | 8GB Memory, 512GB SSD | FHD Screen, WVA TrueLife Touch 250 nits | 7420 - Platinum Silver (D560774WIN9S)",
        "brand": "Dell",
        "description": "BOLD AND VERSATILE - The 360-degree hinge supports four modes to suit your lifestyle: tablet mode to check social media, stand mode to play games, tent mode to stream, or laptop mode to get work done.",
        "price": 79490,
        "discount": 26,
        "inStock": true,
        "soldBy": "Appario Retail Private",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61ZQEkRzQaL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61sbdxO0ohL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61d+hFy9yYL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61QP7brOPqL._SX522_.jpg"
        ],
        "rating": {
            "rating": 4.1,
            "count": 198
        },
        "features": [
            "BE SEEN, BE HEARD - This laptop has a Full HD webcam with a mechanical privacy shutter and AI-powered noise-reducing Waves Maxx Audio Pro mic and speakers to ensure you're seen and heard with clarity.",
            "ELEVATE YOUR EXPERIENCE - Dive into your world with a touchscreen 16:10 display that's easy on the eyes thanks to ComfortView software that reduces blue light and DC dimming that eliminates flicker.",
            "BOLD AND VERSATILE - The 360-degree hinge supports four modes to suit your lifestyle: tablet mode to check social media, stand mode to play games, tent mode to stream, or laptop mode to get work done.",
            "Graphics & Keyboard: Integrated & Standard Keyboard",
            "Display: 15.6 FHD WVA AG Narrow Borde",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Ports: 2x USB 3.2 Gen1 ,1x USB 2.0, HDMI 1.4, SD Card reader, Audio jack, 1 M.2 2230/2280 slot for solid-state drive/Intel Optane",
            "WiFi & Bluetooth- 802.11ac 1x1 WiFi and Bluetooth"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423ef3a447e348910779067",
        "title": "Dell Gaming G15 5525, AMD R5-6600H, 16GB, 512GB SSD, RTX 3050 (4GB GDDR6), 15.6 (39.62Cms) FHD WVA AG 120Hz 250 nits, Windows 11 + MSO'21, Phantom Grey with speckles, 2.51Kgs (D560818WIN9B)",
        "brand": "Dell",
        "description": "BOLD AND VERSATILE - The 360-degree hinge supports four modes to suit your lifestyle: tablet mode to check social media, stand mode to play games, tent mode to stream, or laptop mode to get work done.",
        "price": 78490,
        "discount": 30,
        "inStock": true,
        "soldBy": "Appario Retail Private",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61K9AyvhgmL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61-NxvxHHYL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61e2z7xABOL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61zatxfMTzL._SX522_.jpg"
        ],
        "rating": {
            "rating": 3.1,
            "count": 108
        },
        "features": [
            "BE SEEN, BE HEARD - This laptop has a Full HD webcam with a mechanical privacy shutter and AI-powered noise-reducing Waves Maxx Audio Pro mic and speakers to ensure you're seen and heard with clarity.",
            "ELEVATE YOUR EXPERIENCE - Dive into your world with a touchscreen 16:10 display that's easy on the eyes thanks to ComfortView software that reduces blue light and DC dimming that eliminates flicker.",
            "BOLD AND VERSATILE - The 360-degree hinge supports four modes to suit your lifestyle: tablet mode to check social media, stand mode to play games, tent mode to stream, or laptop mode to get work done.",
            "Graphics & Keyboard: Integrated & Standard Keyboard",
            "Display: 15.6 FHD WVA AG Narrow Borde",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Ports: 2x USB 3.2 Gen1 ,1x USB 2.0, HDMI 1.4, SD Card reader, Audio jack, 1 M.2 2230/2280 slot for solid-state drive/Intel Optane",
            "WiFi & Bluetooth- 802.11ac 1x1 WiFi and Bluetooth"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423effa447e348910779069",
        "title": "Dell G15 15-inch Gaming Laptop (39.62cms) | Intel i5-11260H | 8GB RAM, 512GB SSD | NVIDIA RTX 3050 4GB GDDR6 | 120 HZ | FHD | Windows 11, MSO 2021 | 5511 - Orange LED Backlit KB (D560825WIN9B)",
        "brand": "Dell",
        "description": "Dell G15 15-inch Gaming Laptop (39.62cms) | Intel i5-11260H | 8GB RAM, 512GB SSD | NVIDIA RTX 3050 4GB GDDR6 | 120 HZ | FHD | Windows 11, MSO 2021 | 5511 - Orange LED Backlit KB (D560825WIN9B)",
        "price": 70490,
        "discount": 38,
        "inStock": true,
        "soldBy": "Appario Retail Private",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61nbAXFUnjL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/51XgjWSowiL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61l7o86UcnL._SX522_.jpg",
            "https://m.media-amazon.com/images/I/61wlG+mkKRL._SX522_.jpg"
        ],
        "rating": {
            "rating": 3.9,
            "count": 38
        },
        "features": [
            "KEEP COOL - The Alienware-inspired thermal design draws air from the keyboard and G15's bottom. The four side and rear vents maximize airflow over the copper pipes for cooling and heat dissipation.",
            "GAME-READY GRAPHICS - The G15's Ampere-powered NVIDIA GeForce RTX 3060 card delivers realistic graphics and cutting-edge AI. With up to 6GB GDDR6, enjoy action, faster loading, and quieter operation.",
            "CALIBRATE YOUR CONTROLS - Customize the hardware for each game and the space and setup to make your software look and feel exactly how you want it without affecting gameplay or other activities.",
            "Graphics & Keyboard: Integrated & Standard Keyboard",
            "Display: 15.6 FHD WVA AG Narrow Borde",
            "Warranty: This genuine Lenovo laptop comes with 2 Years onsite manufacturer warranty",
            "Ports: 2x USB 3.2 Gen1 ,1x USB 2.0, HDMI 1.4, SD Card reader, Audio jack, 1 M.2 2230/2280 slot for solid-state drive/Intel Optane",
            "WiFi & Bluetooth- 802.11ac 1x1 WiFi and Bluetooth"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "laptop"
    },
    {
        "_id": "6423f35e447e34891077906b",
        "title": "Samsung 80 cm (32 Inches) Wondertainment Series HD Ready LED Smart TV UA32T4340BKXXL (Glossy Black)",
        "brand": "Samsung",
        "description": "Installation: TV Table stand is not included in the box with this model. customer may ask for Table Top Stand or Wall Mount which will be provided to the customer at the time of installation, please directly call Samsung support on [Please visit brand website for toll free numbers] and provide product's model name as well as seller's details",
        "price": 22490,
        "discount": 30,
        "inStock": true,
        "soldBy": "DAWNTECH ELECTRONICS PRIVATE LIMITED",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71a4ZQNqTiL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/71kLlbUWbhL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/61ssPHyQelL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/616vdmuZhvL._SX569_.jpg"
        ],
        "rating": {
            "rating": 4.9,
            "count": 218
        },
        "features": [
            "Resolution: HD Ready (1366x768) | Refresh Rate: 60 hertz",
            "Connectivity: 2 HDMI ports to connect set top box, Blu Ray players, gaming console | 1 USB ports to connect hard drives and other USB devices",
            "Sound : 20 Watts Output | Dolby Digital Plus",
            "Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie",
            "Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design",
            "Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice",
            "Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423f43c447e34891077906d",
        "title": "Samsung 108 cm (43 inches) Crystal 4K Series Ultra HD Smart LED TV UA43AUE60AKLXL (Black)",
        "brand": "Samsung",
        "description": "Installation: TV Table stand is not included in the box with this model. customer may ask for Table Top Stand or Wall Mount which will be provided to the customer at the time of installation, please directly call Samsung support on [Please visit brand website for toll free numbers] and provide product's model name as well as seller's details",
        "price": 52490,
        "discount": 43,
        "inStock": true,
        "soldBy": "DAWNTECH ELECTRONICS PRIVATE LIMITED",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71eUw15rVbL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/71-aH0TeAvL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/71bEmGWvBXL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/61WBCiijMUL._SX569_.jpg"
        ],
        "rating": {
            "rating": 4.1,
            "count": 8332
        },
        "features": [
            "Resolution: HD Ready (1366x768) | Refresh Rate: 60 hertz",
            "Connectivity: 2 HDMI ports to connect set top box, Blu Ray players, gaming console | 1 USB ports to connect hard drives and other USB devices",
            "Sound : 20 Watts Output | Dolby Digital Plus",
            "Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie",
            "Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design",
            "Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice",
            "Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423f5e1447e34891077906f",
        "title": "Samsung 80 cm (32 inches) HD Ready Smart LED TV UA32T4350AKXXL (Glossy Black)",
        "brand": "Samsung",
        "description": "Installation: TV Table stand is not included in the box with this model. customer may ask for Table Top Stand or Wall Mount which will be provided to the customer at the time of installation, please directly call Samsung support on [Please visit brand website for toll free numbers] and provide product's model name as well as seller's details",
        "price": 24490,
        "discount": 23,
        "inStock": false,
        "soldBy": "DAWNTECH ELECTRONICS PRIVATE LIMITED",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/81b3zUT5SXL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/51ZbtEC9LJL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/81hsOvWkbOL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/81-aLsUQ0hL._SX569_.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 3332
        },
        "features": [
            "Resolution: HD Ready (1366x768) | Refresh Rate: 60 hertz",
            "Connectivity: 2 HDMI ports to connect set top box, Blu Ray players, gaming console | 1 USB ports to connect hard drives and other USB devices",
            "Sound : 20 Watts Output | Dolby Digital Plus",
            "Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie",
            "Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design",
            "Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice",
            "Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423f6c7447e348910779071",
        "title": "Samsung 108 cm (43 Inches) Crystal 7 Series 4K Ultra HD Smart LED TV 43AU7600 (Black) (2022 Model)",
        "brand": "Samsung",
        "description": "Installation: TV Table stand is not included in the box with this model. customer may ask for Table Top Stand or Wall Mount which will be provided to the customer at the time of installation, please directly call Samsung support on [Please visit brand website for toll free numbers] and provide product's model name as well as seller's details",
        "price": 38490,
        "discount": 30,
        "inStock": true,
        "soldBy": "Big Electronic Sale",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/510L500LoJL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/41uiYAKMkzL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/510L500LoJL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/41XDp+cJ2gL._SX569_.jpg"
        ],
        "rating": {
            "rating": 3.1,
            "count": 2332
        },
        "features": [
            "Resolution: 4K Ultra HD (3840x2160) | Refresh Rate: 60 Hertz",
            "Connectivity: 3 HDMI Ports to connect set top box, Blu Ray players, gaming console | 1 USB Ports to connect hard drives and other USB devices | 1 Audio Output | 1 RF Slot",
            "Sound : 20 Watts Output | Dolby Digital Plus",
            "Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie",
            "Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design",
            "Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice",
            "Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423f8b07c43fea1cf4f6fcb",
        "title": "Samsung 32-Inch(80.13Cm) LED 1920 x 1080 Pixels, M5 FHD Smart Monitor, Speakers, Remote, 1 Billion Color, Smart TV apps, TV Plus, Office 365, Apple Airplay, Dex, Bluetooth (LS32BM500EWXXL, Black)",
        "brand": "Samsung",
        "description": "Installation: TV Table stand is not included in the box with this model. customer may ask for Table Top Stand or Wall Mount which will be provided to the customer at the time of installation, please directly call Samsung support on [Please visit brand website for toll free numbers] and provide product's model name as well as seller's details",
        "price": 36490,
        "discount": 10,
        "inStock": true,
        "soldBy": "Big Electronic Sale",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/819il1jGUGL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/71ajsVrCA6L._SX569_.jpg",
            "https://m.media-amazon.com/images/I/81ib-DQAnkL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/71ybHTw0FuL._SX569_.jpg"
        ],
        "rating": {
            "rating": 4.8,
            "count": 532
        },
        "features": [
            "Hub for your home, from any room - Turn your Smart Monitor into a control center for the home by connecting it to your IoT home products with SmartThings.",
            "Game Mode - Optimally adjusts black gamma levels, contrast, sharpness, and color for any game genre.",
            "Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie",
            "Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design",
            "Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice",
            "Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423f9998d604bd918b4541c",
        "title": "PowerMax Fitness TDA-230M (4HP Peak) Smart Folding Electric Treadmill with Auto Incline, MP3, Speaker, DIY and Virtual Assistance, Exercise Machine for Home Gym and Cardio Training",
        "brand": "PowerMax Fitness",
        "description": "The PowerMax Fitness BX-110SX is an exercise bike designed for home use. It features a magnetic resistance system, which allows for a smooth and quiet ride, and can help users achieve weight loss goals. The bike has a sturdy frame and can support users up to 110 kg.",
        "price": 80000,
        "discount": 43,
        "inStock": true,
        "soldBy": "Powermax Fitness India Pvt. Ltd.",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61bFT2jIx6L._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61nx1kdzCqS._SX679_.jpg",
            "https://m.media-amazon.com/images/I/613Jj5U0aJS._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71uKxx9Gv8S._SX679_.jpg"
        ],
        "rating": {
            "rating": 4.4,
            "count": 2390
        },
        "features": [
            " Mobile & Tablet Holder for safe keeping your smart devices while running.",
            "Hydraulic Softdrop System(HSS) for Easy Folding & Unfolding",
            "Running Surface (L X W) – 1260 x 420mm / 49.6 x 16.5 inchesMulti-Function: Massager, Sit-ups, Dumbbells & Twister for waist.",
            "Semi-Auto Lubrication for Easy Maintenance",
            " Wheels for Easy Transportation."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "6423fabb8d604bd918b4541e",
        "title": "Reach B-202 Magnetic Exercise Cycle with 4 kg Flywheel | Upright Stationary Bike for Cardio & Fitness | Adjustable Magnetic Resistance with Cushioned Seat | LCD Screen | Max User Weight 100kg description",
        "brand": "Reach",
        "description": "The B-202 Magnetic Exercise Cycle is an upright stationary bike designed for cardio and fitness workouts. It features a 4 kg flywheel, which provides a smooth and quiet cycling experience, and adjustable magnetic resistance, allowing you to customize your workout intensity.",
        "price": 14499,
        "discount": 27,
        "inStock": true,
        "soldBy": "REACH2FITNESS",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/610HV3qosCL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71q9bAonEYL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61rubOt0c5L._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71DHvIpdM+L._SX679_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 200
        },
        "features": [
            " BUILT & DESIGN: It is made of high-quality material, has an ergonomic and space-saving design. This magnetic upright bike can burn fat quickly, increase your strength and help you achieve your daily fitness goals. Bring the many health benefits of cycling right into your home with the Reach B-202 Upright Exercise Bike.",
            "ADJUSTABLE SEAT POSITIONING & OTHER FEATURES: Features a vertically adjustable seat that accommodates various heights and aids proper body posture during various exercises making it suitable for the whole family. It also has cushioned seat for extra comfort during your workouts. Exercise Cycle has a 4 kg flywheel, 8 Level of Magnetic Resistance, Comfortable anti-slip pedal with adjustable straps, Maximum User weight-100kgs.",
            "MULTI-FUNCTIONAL MONITOR: This cycling machine has a state-of-the-art LCD Screen that tracks Time, Speed, Distance, Calories, and Pulse while you are cycling. Reach B-202 Upright Bike will fit nicely into whichever room you choose.",
            "MAGNETIC UPRIGHT BIKE: Customize your home exercise bike routine with an 8-level of adjustable magnetic tension control system. The magnetic resistance ensures the quiet and silent cycling process. Magnetic resistance is designed to increase tension easily with the resistance control knob while staying low maintenance and silent. Invest in your health with Reach B-202 Exercise Bike for Home Gym."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "6423fb5b7c43fea1cf4f6fcd",
        "title": "LG 80 cm (32 inches) HD Ready Smart LED TV 32LM563BPTC (Dark Iron Gray)",
        "brand": "LG",
        "description": "The LG 80 cm (32 inches) HD Ready Smart LED TV 32LM563BPTC in Dark Iron Gray is a high-quality television that delivers stunning visuals and smart functionality. The TV has a screen size of 80 cm (32 inches) making it a perfect fit for small to medium-sized rooms. It features an HD Ready resolution of 1366x768 pixels that ensures vivid and detailed picture quality. With its smart functionality the LG 32LM563BPTC allows you to access a range of online content including streaming services such as Netflix, Amazon Prime, and YouTube directly on your TV without the need for additional devices. The TV runs on LG's webOS platform which is intuitive and easy to use, allowing you to browse the web, switch between apps and navigate settings with ease.",
        "price": 23490,
        "discount": 32,
        "inStock": true,
        "soldBy": "Big Electronic Sale",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71arAQvySlL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/81AWe7lW2uL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/61JUS9T9LlL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/711mXm3uxnL._SX569_.jpg"
        ],
        "rating": {
            "rating": 4.8,
            "count": 5032
        },
        "features": [
            "Hub for your home, from any room - Turn your Smart Monitor into a control center for the home by connecting it to your IoT home products with SmartThings.",
            "Game Mode - Optimally adjusts black gamma levels, contrast, sharpness, and color for any game genre.",
            "Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie",
            "Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design",
            "Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice",
            "Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423fc017c43fea1cf4f6fcf",
        "title": "LG 108 cm (43 inches) 4K Ultra HD Smart LED TV 43UQ7500PSF (Ceramic Black)",
        "brand": "LG",
        "description": "Smart TV Features: AI ThinQ & WebOS 22 with User Profiles | Game Optimizer & Dashboard | α5 Gen5 AI Processor 4K | Unlimited OTT App Support: Netflix, Prime Video, Disney+ Hotstar, Apple TV, SonyLIV, Discovery+, Zee5 | ALLM & HGiG Mode | HDR 10 Pro & Active HDR",
        "price": 34490,
        "discount": 42,
        "inStock": true,
        "soldBy": " DAWNTECH ELECTRONICS PRIVATE LIMITED",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/91OzzQSg47L._SX569_.jpg",
            "https://m.media-amazon.com/images/I/81-NF9Z2MBL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/71YOWlao2NL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/51DgTA-9wzL._SX569_.jpg"
        ],
        "rating": {
            "rating": 3.8,
            "count": 232
        },
        "features": [
            "Hub for your home, from any room - Turn your Smart Monitor into a control center for the home by connecting it to your IoT home products with SmartThings.",
            "Game Mode - Optimally adjusts black gamma levels, contrast, sharpness, and color for any game genre.",
            "Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie",
            "Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design",
            "Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice",
            "Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423fc498d604bd918b45422",
        "title": "Reach Mini Bike Max Portable Cycle Bike Pedal Exerciser for Foot and Arm, Home & Gym Fitness Equipment with Adjustable Resistance & LCD Monitor",
        "brand": "Reach",
        "description": "The Reach Mini Bike Max Portable Cycle Bike Pedal Exerciser is a compact and versatile fitness equipment that can be used at home or in the gym. It is designed to provide a low-impact workout for both the feet and arms, making it ideal for people who are recovering from injuries or those who want to stay active while working from home.",
        "price": 4999,
        "discount": 40,
        "inStock": true,
        "soldBy": "REACH2FITNESS",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51Jbhjj9twL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61egIoCyJ7L._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61JmY9zefNL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61clpoiRl2L._SX679_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 49
        },
        "features": [
            "[Pedal Machine]: Combined with Arm & Leg exercise by adjustable multi-level resistance, this mini exercise bike trainer can target at providing different exercising level to train your muscle group, upper & lower body exercises with best effect to keep fit.",
            "[Portability]: The Compact and lightweight design of the product makes it easy to operate and transport from any home to the office. Along with it can be used silently without creating any noise.",
            "[Adjustable Tension]: One can change the intensity of the workout by turning the adjustable dial during the workout.",
            "[Digital Monitor]: Equipped with a multifunctional LCD display, it tracks time, distance, count, total counts and calories burned. Large and easy-to-read display can keep track of your workout progress easily",
            "[ Carry Handle] : The carry handle allows for quick and easy portability. Lift it onto your desk for a quick upper body hand pedaling session or move it around your home or office.",
            "[Safe & Stable] :The non-slip rubber pads keep the stationary pedal exerciser in place even at the maximum resistance level without scratching the floor. The non-slip surface of the ergonomic pedals increases friction and safety. Adjustable four-hole foot strap can flexibly adapt to different sizes of feet.",
            "[WARRANTY AND SUPPORT SERVICE]: 6 months of warranty and friendly customer service. Please Contact Our Customer Care at 89562 -12345 for any assistance. We are happy to serve you."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "6423fc998d604bd918b45424",
        "title": "Reach Digital Pedal Exercise Machine | Mini Fitness Cycle For Home With Fixing Strap | Adjustable Resistance Band & LCD Display | Suitable for Light Exercise of Legs, Arms, & Physiotherapy at Home",
        "brand": "Reach",
        "description": "The Reach Digital Pedal Exercise Machine is a mini fitness cycle designed for home use. It is compact and lightweight, making it easy to store and use in small spaces. The machine comes with a fixing strap that allows you to secure it to a chair or other stationary object for added stability during use.",
        "price": 4000,
        "discount": 63,
        "inStock": true,
        "soldBy": "GlobalBees-Brands",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/712GMLoAJ4L._SX679_.jpg",
            "https://m.media-amazon.com/images/I/51IdHPNqgZL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61qStI6jByL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/51AvcVv2QkL._SX679_.jpg"
        ],
        "rating": {
            "rating": 4.2,
            "count": 2250
        },
        "features": [
            "LCD Display & Adjustable Resistance: Its display function shows workout time, number of rotations completed, estimated burn calories, rotations per minute. Easily adjust the tension level with the tension knob for a personalized exercise experience. Great low impact exercise for beginners and perfect for rehabilitation following a surgery or injury.",
            "Compact Storage: It can Easily fit under a desk or someplace cramped. With it's non-slip, nonmarking feet ensure the pedal exerciser stays in place on any surface, including any tabletop, carpet or hard floor surfaces. Each pedal also has a nonslip surface with adjustable toe loops for added comfort and safety. Legs fold under for compact storage and easy portability.",
            "Easy Setup: We have designed this product with your convenience in mind. Our team of engineers have created a quick-step setup to get you toning muscle instantly. All required tools will be included with each purchase for your satisfaction.",
            "Muscle Toning & Fat Loss: Compact folding pedal exerciser can be used to strengthen arms and legs, effectively increasing circulation while improving stamina. The folding pedal exerciser can be used anywhere, for general exercise and physical therapy",
            "EASY INSTALLATION SUPPORT & SERVICE - We offer you 100% risk-free satisfaction guarantee to let you buy with confidence. With Our Friendly Customer Service. We are quite sure that you will be super-impressed with DURABILITY, PORTABILITY and HIGH QUALITY of our Exercise Cycle Pedlar. 6 MONTHS WARRANTY."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "6423fcd47c43fea1cf4f6fd1",
        "title": "LG 81.28 cm (32 Inches) Full HD Smart LED TV 32LQ6360PSA (Black) (2022 Model)",
        "brand": "LG",
        "description": "Smart TV Features: AI ThinQ & WebOS 22 with User Profiles | Game Optimizer & Dashboard | α5 Gen5 AI Processor 4K | Unlimited OTT App Support: Netflix, Prime Video, Disney+ Hotstar, Apple TV, SonyLIV, Discovery+, Zee5 | ALLM & HGiG Mode | HDR 10 Pro & Active HDR",
        "price": 31490,
        "discount": 17,
        "inStock": true,
        "soldBy": "SunCart.",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51OsnWD0ElL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/513h1B1eJdL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/51x5win5pSL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/51UwEWIvWtL._SX569_.jpg"
        ],
        "rating": {
            "rating": 3.8,
            "count": 232
        },
        "features": [
            "Hub for your home, from any room - Turn your Smart Monitor into a control center for the home by connecting it to your IoT home products with SmartThings.",
            "Game Mode - Optimally adjusts black gamma levels, contrast, sharpness, and color for any game genre.",
            "Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie",
            "Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design",
            "Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice",
            "Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423fd797c43fea1cf4f6fd3",
        "title": "LG 121 cm (48 inches) 4K Ultra HD Smart OLED TV 48A2PSA (Rocky Black)",
        "brand": "LG",
        "description": "Connectivity: Wi-Fi (Built-in) | 3 HDMI ports to connect set top box, Blu Ray players, gaming console | 2 USB ports to connect hard drives and other USB devices | eARC | Bluetooth 5.0 | Optical | Ethernet",
        "price": 35490,
        "discount": 19,
        "inStock": true,
        "soldBy": "SunCart.",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/713Q2pEePmL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/81C8LGxanCL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/81X+wgCqqwL._SX569_.jpg",
            "https://m.media-amazon.com/images/I/71JlX+sjaEL._SX569_.jpg"
        ],
        "rating": {
            "rating": 3.2,
            "count": 932
        },
        "features": [
            "Hub for your home, from any room - Turn your Smart Monitor into a control center for the home by connecting it to your IoT home products with SmartThings.",
            "Game Mode - Optimally adjusts black gamma levels, contrast, sharpness, and color for any game genre.",
            "Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie",
            "Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design",
            "Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice",
            "Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423fe198d604bd918b45426",
        "title": "Reach B-200 Magnetic Exercise Cycle for Home Gym | Upright Stationary Exercise Bike for Cardio and Fitness Workout | Adjustable Magnetic Resistance with 4kg Flywheel and Cushioned Seat | Max User Weight 100Kg",
        "brand": "Reach",
        "description": "The Reach - 200 Exercise Bike combines precise engineering with exceptional attention to detail. The bike's contoured upright riding position and large cushioned seat allow for a comfortable ride. The self-powered model doesn't require cords or outlets, so it's well suited for any room in your home. This upright exercise bikes are the perfect low-impact solution for when you want the feel of an outdoor bike but with more security and stability. Reach has been dedicated to creating innovative, reliable and effective fitness Gym equipment designed to help exercisers reach their fitness goals. All REACH Fitness products are held to the highest international standards. When you buy Reach, you buy directly from the manufacturer, so you can rest assured you're getting a dependable machine for the best value.",
        "price": 22999,
        "discount": 59,
        "inStock": true,
        "soldBy": "REACH2FITNESS",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/418OVUVRsvL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/51qM-z7+YML._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61p4m7KwtTL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61w7gvJfZiL._SX679_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 102
        },
        "features": [
            "HEAVY-DUTY CONSTRUCTION: Manufactured from high-grade steel, this bike features a durable frame that combines design and performance. The design facilitates quick entry and exit from the bike and it can support a user weighing up to 100 kg.",
            "ADJUSTABLE SEAT POSITIONING: Fitness bike features an adjustable seat that accommodates various heights and aids proper body posture during exercise, making it more conducive to attaining your workout goals in a more comfortable and safe stationary bike.",
            "ULTRA-FUNCTIONAL CONSOLE: The Reach B- 200 Upright Exercise Bike has a state-of-the-art LCD screen that acts as an odometer and displays time, speed, distance, and calories burned in extra-large numbers for great readability."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "6423ff0c7c43fea1cf4f6fd5",
        "title": "LG 108 cm (43 Inches) Full HD Smart LED TV 43LM5600PTC (Dark Iron Gray)",
        "brand": "LG",
        "description": "Dynamic Color Enhancer This Full HD LED Smart TV features an image processor that adjusts the color of your content to deliver rich and natural-looking images. Wide Viewing Angle The 108 cm (43) display of this LG TV will leave you enthralled with the realism it delivers. The color reproduction, which is almost 100% accurate, can be enjoyed from all angle",
        "price": 41490,
        "discount": 13,
        "inStock": true,
        "soldBy": "VEEBAA.",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/81z-Ir0qCFL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81syV9qGS1L._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81GvngEq41L._SX425_.jpg",
            "https://m.media-amazon.com/images/I/61KYJtW6MmL._SY879_.jpg"
        ],
        "rating": {
            "rating": 4.9,
            "count": 339
        },
        "features": [
            "Resolution: Full HD (1920x1080) | Refresh Rate: 50 hertz",
            "Connectivity: 2 HDMI ports to connect set top box, Blu Ray players, gaming console | 1 USB ports to connect hard drives and other USB devices.",
            "Sound : 20 Watts Output | Powerful Sound",
            "Smart TV Features : AI ThinQ |One touch access to Netflix and amazon prime | Miracast (screen sharing) | AI launcher",
            "Display : Active HDR | HDR dynamic tone mapping | DTS virtual",
            " XWarranty Information: 1 Year LG India Comprehensive Warranty and additional 1 year Warranty is applicable on panel/module from the date of purchase",
            "Installation: For requesting installation/wall mounting/demo of this product once delivered"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "tv"
    },
    {
        "_id": "6423ff758d604bd918b45428",
        "title": "Reach AB-90 Air Bike Exercise Cycle Indoor Gym Equipment | Stationary Upright Exercise Bike for Fitness & Cardio Workouts | Suitable for Weight Loss Exercise with Adjustable Seat & Resistance",
        "brand": "Reach",
        "description": "Reach AB-90 is made with a durable steel frame, this unit showcases solid construction that is built to last. Compact and stabilized with high-density and vinyl-covered foam, the seat pad provides great support for an enjoyable workout.",
        "price": 6999,
        "discount": 29,
        "inStock": true,
        "soldBy": "REACH2FITNESS",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51bys562GSL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/611tBKcUqKL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61YSWqUxJtL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61E+L0zSoLL._SX679_.jpg"
        ],
        "rating": {
            "rating": 4.2,
            "count": 716
        },
        "features": [
            " STEEL CONSTRUCTION Made with a durable steel frame, this unit showcases solid construction that is built to last. Maximum User Weight - 100 KG",
            "EASY INTERFACE - This stationary bike comes with a user-friendly tracker and an LCD that allows you to scan modes and track your time, distance, speed, and calories burned as you exercise.",
            "ERGONOMIC SEATING - The Exercise Fitness Bike is ergonomically made for seating with large adjustable seat cushion. Its handlebars are packed with high-density foam, which will prevent you from experiencing stiffness of the back, strains, and muscle aches as you work out.",
            "BELT DRIVE RESISTANCE - Belt requires restricted maintenance, improves pedaling technique, permits less momentum-based recovery, makes the rider work efficiently and operates quietly.",
            "EASY INSTALLATION & SUPPORT SERVICE - 1 Year Warranty. We are quite sure that you will be super-impressed with DURABILITY, PORTABILITY of our Exercise Cycle."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Exercise Machines"
    },
    {
        "_id": "642400ab8d604bd918b4542a",
        "title": "Boldfit Adjustable Hand Grip Strengthener, Hand Gripper for Men & Women for Gym Workout Hand Exercise Equipment to Use in Home for Forearm Exercise, Finger Exercise Power Gripper",
        "brand": "Boldfit",
        "description": "The Boldfit Adjustable Hand Grip Strengthener is a hand gripper designed for both men and women who are looking to strengthen their hand grip and forearm muscles. It is a perfect exercise equipment for gym workouts or to use at home for finger and forearm exercises.",
        "price": 499,
        "discount": 58,
        "inStock": true,
        "soldBy": "RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71PXHvmjz1L._SX679_.jpg",
            "https://m.media-amazon.com/images/I/91+UlCiVZML._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71mSl6xM80L._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71M-9DaU7JL._SX679_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 8740
        },
        "features": [
            "ADJUSTABLE RESISTANCE : You Can Adjust Resistance Of Your Hand Gripper From 10-40 Kgs As Per Requirements. Also Its Easy And Fast To Do So.",
            "COMFORTABLE HANDLE : Handle Is Comfortable To Hold And Made From Non-slip Material. Hence It Will Give You Extra Grip And Comfort While Exercise",
            "FOREARM & FINGER EXERCISE EQUIPMENT : Boldfit Hand Grip Strengthener Is Useful In Forearm/wrist Workout As Well As In Finger Exercise.",
            "DURABLE : Quality Material Used In Boldfit Handgrip Exerciser E.g. Spring Made From Staleness Steel, Quality Non- Slip Material Used On Handles. Overall Its Made For Bold,Made For Last Long.",
            "GYM AND HOME USE : Boldfit Hand Grip Excerciser Is Suitable In Gym And Home Use As Well As For Men And Women. It Is Easy To Use And Easy To Handle Is Well."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "642401738d604bd918b4542c",
        "title": "Boldfit Yoga Mats For Women yoga mat for men Exercise mat for home workout yoga mat for women gym mat Anti Slip Yoga mat Workout mat Yoga Mat For Kids Yoga mate gym mats for workout at home",
        "brand": "Boldfit",
        "description": "Sweat Resistant and Washable Workout Mat - Next time don’t stress when you sweat while doing yoga. The exercise mat for women is completely sweat resistant and has a Moisture resistant Technology which makes the gym mats easily washable with soap and water",
        "price": 397,
        "discount": 0,
        "inStock": true,
        "soldBy": "RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/81Qft4sWORL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/81681kH5ULL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71SLAV+VSOL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/913gM03xU6L._SX679_.jpg"
        ],
        "rating": {
            "rating": 4,
            "count": 9892
        },
        "features": [
            "Comfortable Yoga Mats - 6 feet long & 2 feet wide ( 183 cm X 61 cm ) ensures comfort for people of all shapes and sizes. With highly durable EVA material, the 4 mm thick premium mat comfortably cushions spine, hips, knees and elbows on hard floors. The mat size is perfect for men and women of all shapes. This is the best yoga mat for men and women alike",
            "Yoga Mat with Strap - A yoga mat strap is included with our Boldfit EVA all-purpose premium workout mat , Easy strapping and light weight feature are added to this mat for easy transport and storage. Carry around your yoga mat & flaunt it with ease!",
            "Anti Slip Mat with Extra Grip - With double sided non-slip surfaces, Boldfit EVA gym mat comes with an excellent slip resistant advantage to prevent injuries and perform any move with confidence. This anti skid mat wavy bottom side stops the mat from sliding on the floor and gives you that much needed extra grip! The beautiful texture on the top surface prevents the hands and feet from slipping out of position. Now whether its heavy asana’s or just surya namaskar’s do it",
            "Durable Yoga Mats for Women - The EVA material is extremely durable. It lasts more than a regular plasticky mat! this yoga mats for workout at home men is free from toxic materials. We believe in creating quality products for our customers!",
            "Sweat Resistant and Washable Workout Mat - Next time don’t stress when you sweat while doing yoga. The exercise mat for women is completely sweat resistant and has a Moisture resistant Technology which makes the gym mats easily washable with soap and water"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "642402518d604bd918b4542e",
        "title": "Boldfit Yoga Mats for Women and Men NBR Material with Carrying Strap, 10mm Extra Thick Exercise Mats for Workout Yoga Mat for Women for Workout, Yoga, Fitness, Exercise Mat Anti Slip Yoga Mats - Black",
        "brand": "Boldfit",
        "description": "The Boldfit Yoga Mats are designed for both men and women who want to improve their yoga practice and overall fitness routine. Made with NBR material, these mats are 10mm thick, providing extra cushioning and support for the user's joints during workouts.",
        "price": 1799,
        "discount": 53,
        "inStock": true,
        "soldBy": "RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51DQOog9KIL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71YB9BCqayL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61m-VkpCEBL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/51GpiAAhFqL._SX679_.jpg"
        ],
        "rating": {
            "rating": 3.9,
            "count": 2887
        },
        "features": [
            "Size - 6 feet long & 2 feet wide (183 cm x 61 cm) ensures comfort for people of all shapes and sizes With high density foam material, the 10 mm thick premium mat comfortably cushions spine, hips, knees and elbows on hard floors",
            "This makes is it the perfect size for both men & women",
            "Anti slip mat - with double sided non-slip surfaces, Boldfit supreme all-purpose",
            "Premium exercise yoga Mat comes with an excellent slip resistant advantage to prevent injuries",
            "Durable - exceptional resilience allow you to keep your balance during any exercise style",
            "Water & sweat resistant -moisture resistant technology makes the mat to be easily washed with soap and water"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "6424033f8d604bd918b45430",
        "title": "Boldfit Hand Grip 10kg to 60kg Adjustable Hand Grip Strengthener, Hand Gripper for Men & Women for Gym Workout & Home Use(Blue) & Abs Roller For Men, Abs Exercise Equipment With Knee Mat, Red, Medium",
        "brand": "Boldfit",
        "description": "The hand gripper 60 kg is easy to adjust the resistance from 10-60Kgs as needs. The hand Gripper is suitable for everyone, like Athletes, sports, fitness coaches, fitness, musicians and people who want to exercise their hand, wrist and fingers. Also its easy and fast to do so. The resistance of hand grips for strength training is perfect for both men and women with different strength as it can be adjusted easily.",
        "price": 1398,
        "discount": 53,
        "inStock": true,
        "soldBy": "RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/518JhA5zoNL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61Zo1EH5EUS._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71XSPsDwivS._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61FDqqBl2mL._SX679_.jpg"
        ],
        "rating": {
            "rating": 3.9,
            "count": 2887
        },
        "features": [
            "In-box Contents: 1 Hand Grip Adjustable resistance: you can adjust resistance of your hand gripper from 10-40 kg as per requirements Also its easy and fast to do so",
            "Comfortable handle: handle is comfortable to hold and made from non-slip material Hence it will give you extra grip and comfort while exercise",
            "Forearm & finger exercise equipment: Boldfit hand grip strengthener is useful in forearm/wrist workout as well as in finger exercise",
            "Ergonomic Design - Ultra-wide Ab Roller With Built-in Resistance And Ergonomic Handles To Help Maximize Results Of Ab Roll-out Exercises. We Take Design Seriously, So This Abs Exercise Machine Is Ideal With A Steel Bar To Increase Durability And Safety",
            "Tone Your Body - The Six Pack Abs Exerciser Machine Helps Strengthen, Develop And Tone Your Body. Burns Calories And Help Build Your 6 Pack. The Abs Roller Wheel Acts As Your Personal Fitness Trainer - Helping You To Build Stronger And Bigger Six Pack Abs, Burn Calories, Build Muscle And Improve Your Overall Endurance",
            "Core Abdominal Muscles - The Abs Machine Targets The Core Abdominal Muscles And Helps Build Your Strength And Endurance. Train With One Of The Most Effective Pieces Of Home Exercise Equipment",
            "Efficient Ab Stomach Exercise Machine - The Ab Cruncher Provides Superb Convenience And Efficiency For Abdominal & Core Strength Training. Unlike Big Machines, Ab Wheel Is Portable That Enables You To Take It Anywhere To Exercise, Be It Your Home, Office, Gym, Or Outdoor"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "6424048e8d604bd918b45432",
        "title": "Boldfit Hand Grip 10kg to 60kg Adjustable Hand Grip Strengthener, Hand Gripper for Men & Women for Gym Workout & Home Use (Blue) & Resistance Tube with Foam Handles (Blue -20KG)",
        "brand": "Boldfit",
        "description": "COMFORTABLE HANDLE : Handle Is Comfortable To Hold And Made From Non-slip Material. Hence It Will Give You Extra Grip And Comfort While Exercise.",
        "price": 1698,
        "discount": 63,
        "inStock": true,
        "soldBy": "RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/7136Tv3BqhL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61Zo1EH5EUS._SX679_.jpg",
            "https://m.media-amazon.com/images/I/8122rGFm0hL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71aWRDYO2BS._SX679_.jpg"
        ],
        "rating": {
            "rating": 3.9,
            "count": 2887
        },
        "features": [
            "ADJUSTABLE RESISTANCE : You Can Adjust Resistance Of Your Hand Gripper From 10-40 Kgs As Per Requirements. Also Its Easy And Fast To Do So.",
            "COMFORTABLE HANDLE : Handle Is Comfortable To Hold And Made From Non-slip Material. Hence It Will Give You Extra Grip And Comfort While Exercise",
            "FOREARM & FINGER EXERCISE EQUIPMENT : Boldfit Hand Grip Strengthener Is Useful In Forearm/wrist Workout As Well As In Finger Exercise.",
            "DURABLE : Quality Material Used In Boldfit Handgrip Exerciser E.g. Spring Made From High Quality Staleness Steel, Quality Non- Slip Material Used On Handles. Overall Its Made For Bold,Made For Last Long.",
            "RESISTANCE TUBES THAT ARE EASY TO USE : Made from 100% latex. Comes in 4 different resistance strength levels: Light, Medium, Heavy and X-Heavy. They're suitable for beginner or a seasoned workout sportsman.",
            "TAKE YOUR WORKOUTS TO THE NEXT LEVEL: Whether you are a beginner or expert, resistance Tubes have a place in your home gym. Resistance Tubes work your muscles like weights do – your muscles contract to generate force to stabilize and control the desired"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "6424058b8d604bd918b45434",
        "title": "Strauss Adjustable Hand Grip| Adjustable Resistance (10KG - 40KG) | Hand/Power Gripper for Home & Gym Workouts | Perfect for Finger & Forearm Hand Exercises & Strength Building for Men & Women (Black/Green)",
        "brand": "STRAUSS",
        "description": "The Strauss Adjustable Hand Grip is a versatile and convenient tool for building hand and forearm strength at home or in the gym. This gripper features adjustable resistance, ranging from 10kg to 40kg, allowing users to tailor their workouts to their individual needs and goals.",
        "price": 575,
        "discount": 62,
        "inStock": true,
        "soldBy": "GlobalBees-Brands",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61GpGJIhPmL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71w+L1yskoL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71r3-UkXDUL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/81kgBUyq8UL._SX679_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 23534
        },
        "features": [
            "IMPROVED FINGER STRENGTH: Strauss Hand grip strengthener is ideal for improving the strength and speed of fingers",
            "EASY-ADJUSTABLE RESISTANCE: Easy to adjust the resistance from 10 kgs-40 kgs as needs. The hand Gripper is suitable for everyone, like Athletes, sports, fitness, musicians and people who want to exercise their hand, wrist and fingers.",
            "INJURY REHABILITATION: Rehabilitate and relieve pain using the hand strengthener, for conditions such as: Arthritis, carpal tunnel syndrome, tendonitis, rheumatoid arthritis etc.",
            "DURABLE & ERGONOMIC DESIGN: With Strauss hand grip , you could train your hand at any time. With high quality and soft materials and, our Hand Grip Strengthener will make your exercise more comfortable and safe.",
            "IN-BOX CONTENTS: 1 pics Adjustable Hand Grip"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "642406388d604bd918b45436",
        "title": "Strauss Adjustable Hand Grip Strengthener, (Black) Hand Exerciser, Strength Trainer,Non-Slip Gripper, Great for Athletes Pianists Kids Hand Rehabilitation Exercising Hand Gripper, Plastic",
        "brand": "STRAUSS",
        "description": "The Strauss Adjustable Hand Grip Strengthener is a hand exerciser and strength trainer designed to help individuals improve their hand and forearm strength. This gripper is made of plastic and comes in a sleek black color, making it a versatile and stylish addition to any workout routine.",
        "price": 1174,
        "discount": 54,
        "inStock": true,
        "soldBy": "RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71gU0OY1YeL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61vxZ9hqRjL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71OyXZZ-iUL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/61+BH8hzyIL._SX679_.jpg"
        ],
        "rating": {
            "rating": 4,
            "count": 1
        },
        "features": [
            "IMPROVED FINGER STRENGTH: Strauss Hand grip strengthener is ideal for improving the strength and speed of fingers",
            "EASY-ADJUSTABLE RESISTANCE: Easy to adjust the resistance from 10 kgs-40 kgs as needs. The hand Gripper is suitable for everyone, like Athletes, sports, fitness, musicians and people who want to exercise their hand, wrist and fingers.",
            "INJURY REHABILITATION: Rehabilitate and relieve pain using the hand strengthener, for conditions such as: Arthritis, carpal tunnel syndrome, tendonitis, rheumatoid arthritis etc.",
            "DURABLE & ERGONOMIC DESIGN: With Strauss hand grip , you could train your hand at any time. With high quality and soft materials and, our Hand Grip Strengthener will make your exercise more comfortable and safe.",
            "IN-BOX CONTENTS: 1 pics Adjustable Hand Grip"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "642407078d604bd918b45438",
        "title": "Strauss Yoga Mat, 6mm (Grey) for Gym Workout and Yoga Exercise +Strauss Yoga Mat, 4 mm, (Grey)",
        "brand": "STRAUSS",
        "description": "The Strauss Yoga Mat is a high-quality mat designed for gym workouts and yoga exercises. It is available in two thickness options - 6mm and 4mm - both of which provide a comfortable and supportive surface for users to practice their routines on.",
        "price": 2198,
        "discount": 56,
        "inStock": true,
        "soldBy": "RetailEZ Pvt Ltd",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51BDJh71AkL._SX679_.jpg"
        ],
        "rating": {
            "rating": 4,
            "count": 1
        },
        "features": [
            "CLASSIC YOGA MAT: 68 Long and 24 wide ensures comfort for all types of exercise. The 6mm thick premium mat comfortably cushions spine, hips, knees, and elbows on hard floors while keeping you balanced.",
            "LIGHTWEIGHT & THICK YOGA MAT: These durable, yet lightweight exercise yoga mats are extra thick for the additional cushioning your joints need during any yoga or fitness routine",
            "STICKY NON SLIP TEXTURE: Yoga mat features a textured sticky non slip surface for excellent traction and superior grip to keep you motivated and focused",
            "ANTI TEAR YOGA MAT: With integrated anti-tearing net and high quality material, you can use this mat for most yoga poses and exercise activities."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "642407b68d604bd918b4543a",
        "title": "STRAUSS Stretch-Back Gym Gloves with Leather Palm, (Medium)",
        "brand": "STRAUSS",
        "description": "The STRAUSS Stretch-Back Gym Gloves with Leather Palm are a high-quality pair of workout gloves designed to provide maximum comfort and support during gym workouts. These gloves are available in size medium and feature a durable leather palm that provides excellent grip and protection against calluses and blisters.",
        "price": 1299,
        "discount": 81,
        "inStock": true,
        "soldBy": "GlobalBees-Brands",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71zKWjbkuyL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/7151pfjrgSL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/715IskVSeQL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/81V0yKfCxzL._SX679_.jpg"
        ],
        "rating": {
            "rating": 3.6,
            "count": 90
        },
        "features": [
            "Heavy duty StretchBack extends across fingers and back of hand to enhance ventilation, flexibility, comfort and fit.",
            "Leather Palm - Protects hand and maintains a strong feel on the bar.",
            "Double Stitched - For enhanced durability.",
            "Wrap-around thumb protection cushions and covers the inside of the thumb with a second layer of leather to protect against abrasion.",
            "Fully adjustable wrist closure"
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "642408528d604bd918b4543c",
        "title": "Strauss Adjustable Square Finger Hand Grip, (Orange)",
        "brand": "STRAUSS",
        "description": "The Strauss Adjustable Square Finger Hand Grip is a versatile and convenient tool designed to help users improve their grip strength and overall hand health. This grip features an adjustable resistance level, which ranges from 10kg to 40kg, allowing users to customize their workout to their individual needs and goals..",
        "price": 799,
        "discount": 61,
        "inStock": true,
        "soldBy": "GlobalBees-Brands",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51zYFgRjLUL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71EoTZs50gL._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71fBDIgYU2L._SX679_.jpg",
            "https://m.media-amazon.com/images/I/71AKYiMITqL._SX679_.jpg"
        ],
        "rating": {
            "rating": 4.2,
            "count": 68
        },
        "features": [
            "All-in-one hand exerciser specifically design for many musical instrument. Also can be used for finger strength exercise in daily life.",
            "Safely and conveniently build strength, endurance, and flexibility and coordination, provides a complete strength training solution for fingers, hands, wrists, and forearms",
            "Individual finger tension is adjustable, You can select different tensions for each finger, providing all-in-one hand fitness.",
            "Using silicone material, soft design, comfortable pressing, will not hurt your fingers. Durable, longer using time.",
            "Extremely portable design, you can use it in easily, strength your fingers at any time when you want."
        ],
        "offers": [
            "About No Cost EMI on credit/debit cards: interest to be charged by the bank will be given as upfront discount on payment page",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "fitness",
        "subCategory": "Gymnastics"
    },
    {
        "_id": "64248ac1ebb677e8b37d4931",
        "title": "xxx",
        "brand": "xxx",
        "description": "Philips Audio Tws Tat1215 Bluetooth Truly Wireless In Ear Earbuds With Mic With 18 Hr Playtime - 6+12, Ipx4, Voice Assistant (Black)",
        "price": 4999,
        "discount": 62,
        "inStock": true,
        "soldBy": "GoodLuck Shoppie and Fulfilled by Amazon.",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41JjWA1nbPL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/41hmCqDETVL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81gCXp0kxjL._SX425_.jpg",
            "https://m.media-amazon.com/images/I/81+Qhr2-VZL._SX425_.jpg"
        ],
        "rating": {
            "rating": 4.5,
            "count": 7
        },
        "features": [
            "Total 18 hours play time (6 hours on single charge), 2 hours charging time",
            "Built-in mic with echo cancellation for clear audio",
            "Secure, comfortable fit",
            "Earbud switches to control music, calls, and volume",
            "6 mm Neodymium drivers. Clear sound, punchy bass"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "electronics",
        "subCategory": "audio"
    },
    {
        "_id": "6429e8e1f2c14d2086e7889b",
        "title": "Leather Accent Chair",
        "brand": "Ashley Furniture",
        "description": "Add a touch of elegance to your living room with this leather accent chair. The chair features a comfortable cushioned seat and backrest, and sleek modern design.",
        "price": 299.99,
        "discount": 15,
        "inStock": true,
        "soldBy": "Ashley Furniture",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71tiVjTiRUL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/616FlxhH0RL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.2,
            "count": 19
        },
        "features": [
            "Leather upholstery",
            "Solid wood frame",
            "Foam cushioning"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "chair"
    },
    {
        "_id": "6429ea17f2c14d2086e7889e",
        "title": "Reclining Sofa",
        "brand": "La-Z-Boy",
        "description": "Enjoy the ultimate relaxation with this reclining sofa. The sofa features plush cushioning, easy-to-use reclining mechanism, and durable fabric upholstery.",
        "price": 899.99,
        "discount": 12,
        "inStock": true,
        "soldBy": "La-Z-Boy",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71huZY5DUlL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61Qk2i1rzWL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61-IpQUowFL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61Usxv6U2CL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.8,
            "count": 25
        },
        "features": [
            "Fabric upholstery",
            "Reclining mechanism",
            "Durable construction"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "sofa"
    },
    {
        "_id": "6429ea41f2c14d2086e788a0",
        "title": "Queen Size Bed Frame",
        "brand": "Zinus",
        "description": "Create a cozy bedroom with this queen size bed frame. The frame features a classic design, sturdy construction, and easy-to-assemble.",
        "price": 219.99,
        "discount": 21,
        "inStock": true,
        "soldBy": "Zinus",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61Gn7qpnjAL._SL1000_.jpg",
            "https://m.media-amazon.com/images/I/51JjRDyZ2PL._SL1000_.jpg",
            "https://m.media-amazon.com/images/I/51G0HrE9usL._SL1000_.jpg",
            "https://m.media-amazon.com/images/I/417Apy1H65L._SL1000_.jpg"
        ],
        "rating": {
            "rating": 4.5,
            "count": 37
        },
        "features": [
            "Classic design",
            "Sturdy construction",
            "Easy-to-assemble"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "bed"
    },
    {
        "_id": "6429ea5bf2c14d2086e788a2",
        "title": "Dining Table Set",
        "brand": "Coaster Home Furnishings",
        "description": "Gather your family and friends for a delicious meal with this dining table set. The set includes a rectangular table and six chairs, all with a stylish and sturdy design.",
        "price": 699.99,
        "discount": 5,
        "inStock": true,
        "soldBy": "Coaster Home Furnishings",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61I+Vf7ze4L._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81KxUfej2BL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61jmUkoqTNL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61jmUkoqTNL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.3,
            "count": 46
        },
        "features": [
            "Rectangular table",
            "Six chairs",
            "Stylish and sturdy design"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "dining table"
    },
    {
        "_id": "6429ea6ef2c14d2086e788a4",
        "title": "Bookshelf",
        "brand": "IKEA",
        "description": "Organize your books and decor with this sleek and functional bookshelf. The shelf features multiple levels and compartments, perfect for any space.",
        "price": 129.99,
        "discount": 8,
        "inStock": true,
        "soldBy": "IKEA",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/91rzxU2oW0L._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/619Q1y6x88L._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71gmALwt6HL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61N9ZagH5QL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4,
            "count": 19
        },
        "features": [
            "space for 50 books",
            "corner lights",
            "Stylish and sturdy design"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "bookshelf"
    },
    {
        "_id": "6429ea88f2c14d2086e788a6",
        "title": "Wingback Chair",
        "brand": "Pottery Barn",
        "description": "Experience comfort and style with this wingback chair. The chair features a classic design with nailhead trim, and plush cushioning for a cozy feel.",
        "price": 599.99,
        "discount": 13,
        "inStock": true,
        "soldBy": "Pottery Barn",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71uzYX3DZqL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71L5+R9SOPL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.6,
            "count": 17
        },
        "features": [
            "Classic design",
            "Nailhead trim",
            "Plush cushioning"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "chair"
    },
    {
        "_id": "6429ea9ff2c14d2086e788a8",
        "title": "Sectional Sofa",
        "brand": "Article",
        "description": "Upgrade your living room with this spacious sectional sofa. The sofa features a modern design with adjustable headrests, and soft velvet upholstery for ultimate comfort.",
        "price": 2599.99,
        "discount": 14,
        "inStock": true,
        "soldBy": "Article",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71M6GaB7y0L._SL1400_.jpg",
            "https://m.media-amazon.com/images/I/71DKPTYp-iL._SL1400_.jpg",
            "https://m.media-amazon.com/images/I/61eFtmMsUmL._SL1400_.jpg",
            "https://m.media-amazon.com/images/I/516JD2Fw1TL._SL1024_.jpg"
        ],
        "rating": {
            "rating": 4.9,
            "count": 9
        },
        "features": [
            "Modern design",
            "Adjustable headrests",
            "Soft velvet upholstery"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "sofa"
    },
    {
        "_id": "6429eab9f2c14d2086e788aa",
        "title": "Platform Bed",
        "brand": "Modway",
        "description": "Create a chic and modern bedroom with this platform bed. The bed features a clean-lined design, sturdy construction, and upholstered headboard for added comfort.",
        "price": 479.99,
        "discount": 18,
        "inStock": true,
        "soldBy": "Modway",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71rpkgju2SL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71Dk9TzQr2L._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/6124TObAi2L._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/6124TObAi2L._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.2,
            "count": 31
        },
        "features": [
            "Clean-lined design",
            "Sturdy construction",
            "Upholstered headboard"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "bed"
    },
    {
        "_id": "6429eacef2c14d2086e788ac",
        "title": "Bar Height Dining Set",
        "brand": "Signature Design by Ashley",
        "description": "Create a modern and functional dining space with this bar height dining set. The set includes a table and four stools, all with a sleek design and sturdy construction.",
        "price": 899.99,
        "discount": 39,
        "inStock": true,
        "soldBy": "Signature Design by Ashley",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71c2A4+CkmL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71WDW9eU4BS._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81mms8SWM9L._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81EV7qDCeMS._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.4,
            "count": 13
        },
        "features": [
            "Bar height table",
            "Four stools",
            "Sleek design and sturdy construction"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "dining table"
    },
    {
        "_id": "6429eae0f2c14d2086e788ae",
        "title": "Corner Bookshelf",
        "brand": "Winsome Wood",
        "description": "Maximize your storage space with this corner bookshelf. The shelf features multiple levels and a compact design, perfect for any corner of your room.",
        "price": 79.99,
        "discount": 8,
        "inStock": true,
        "soldBy": "Winsome Wood",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/716vJr4JDKL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61n2iRmx-VL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/816u0SBdhHL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81aDsG0ixRL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 2.4,
            "count": 25
        },
        "features": [
            "Sleek design",
            "Corner lights"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "bookshelf"
    },
    {
        "_id": "6429eaf0f2c14d2086e788b0",
        "title": "Armless Accent Chair",
        "brand": "Target",
        "description": "Add a pop of color to your living room with this armless accent chair. The chair features a modern design and a comfortable padded seat.",
        "price": 179.99,
        "discount": 14,
        "inStock": true,
        "soldBy": "Target",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/21yljfLippL.jpg",
            "https://m.media-amazon.com/images/I/21yljfLippL.jpg"
        ],
        "rating": {
            "rating": 4.1,
            "count": 36
        },
        "features": [
            "Padded seat",
            "Armless design",
            "Modern style"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "chair"
    },
    {
        "_id": "6429eb06f2c14d2086e788b2",
        "title": "Sectional Sofa",
        "brand": "50",
        "description": "Create a cozy and comfortable living space with this sectional sofa. The sofa features a spacious design and plush cushions for maximum relaxation.",
        "price": 1399.99,
        "discount": 15,
        "inStock": true,
        "soldBy": "Bob's Furniture",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71gMgsbdOiL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61RQPwYDouL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61e2cCs8rOL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61qlvzHLf1L._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 31
        },
        "features": [
            "Spacious design",
            "Plush cushions",
            "Durable construction"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "sofa"
    },
    {
        "_id": "6429eb1af2c14d2086e788b4",
        "title": "Platform Bed",
        "brand": "Novogratz",
        "description": "Create a minimalist and modern bedroom with this platform bed. The bed features a simple yet stylish design, and sturdy construction.",
        "price": 299.99,
        "discount": 5,
        "inStock": true,
        "soldBy": "Novogratz",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71AEOhZkRjL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71fhqZC-neL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81UXVH2y1uL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71LBCOSZ3vL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.4,
            "count": 29
        },
        "features": [
            "Minimalist design",
            "Sturdy construction",
            "Easy-to-assemble"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "bed"
    },
    {
        "_id": "6429eb32f2c14d2086e788b6",
        "title": "Counter Height Dining Set",
        "brand": "Signature Design by Ashley",
        "description": "Upgrade your dining space with this counter height dining set. The set includes a square table and four chairs, all with a chic and stylish design.",
        "price": 699.99,
        "discount": 20,
        "inStock": true,
        "soldBy": "Signature Design by Ashley",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51VQ5MTKeWL.jpg",
            "https://m.media-amazon.com/images/I/510QOm1aq6L.jpg",
            "https://m.media-amazon.com/images/I/51VQ5MTKeWL.jpg"
        ],
        "rating": {
            "rating": 4.6,
            "count": 14
        },
        "features": [
            "Counter height table",
            "Four chairs",
            "Chic and stylish design"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "dining table"
    },
    {
        "_id": "6429eb41f2c14d2086e788b8",
        "title": "Swivel Office Chair",
        "brand": "Herman Miller",
        "description": "Upgrade your workspace with this swivel office chair. The chair features a comfortable design, adjustable height, and durable construction.",
        "price": 699.99,
        "discount": 45,
        "inStock": true,
        "soldBy": "Herman Miller",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71-ZmhEo-aL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71-ZmhEo-aL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 10
        },
        "features": [
            "Comfortable design",
            "Adjustable height",
            "Durable construction"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "chair"
    },
    {
        "_id": "6429eb56f2c14d2086e788ba",
        "title": "Sectional Sofa",
        "brand": "Pottery Barn",
        "description": "Make your living room the ultimate comfort zone with this sectional sofa. The sofa features soft cushions, modular design, and luxurious upholstery.",
        "price": 2399.99,
        "discount": 0.25,
        "inStock": true,
        "soldBy": "Pottery Barn",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/81RPOllnBqL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/718odFQQaKL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61-DIAHBh1L._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71zbYiZP2mL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71LxdRcVkBL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.9,
            "count": 17
        },
        "features": [
            "Soft cushions",
            "Modular design",
            "Luxurious upholstery"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "sofa"
    },
    {
        "_id": "6429eb6ef2c14d2086e788bc",
        "title": "Platform Bed",
        "brand": "Modway",
        "description": "Elevate your bedroom decor with this platform bed. The bed features a sleek design, sturdy construction, and easy-to-clean upholstery.",
        "price": 399.99,
        "discount": 70,
        "inStock": true,
        "soldBy": "Modway",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41Y4HDbHRxL.jpg",
            "https://m.media-amazon.com/images/I/31tjTLA7CUL.jpg",
            "https://m.media-amazon.com/images/I/41Y4HDbHRxL.jpg",
            "https://m.media-amazon.com/images/I/41XWXZAQGLL.jpg"
        ],
        "rating": {
            "rating": 4.4,
            "count": 21
        },
        "features": [
            "Soft & comfortable",
            "Modular upholstery",
            "Luxurious design"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "bed"
    },
    {
        "_id": "6429eb81f2c14d2086e788be",
        "title": "Leather Recliner",
        "brand": "Barcalounger",
        "description": "Relax in style with this leather recliner. The chair features a comfortable cushioned seat and backrest, and a smooth reclining mechanism.",
        "price": 599.99,
        "discount": 29,
        "inStock": true,
        "soldBy": "Barcalounger",
        "imageUrls": [
            "https://example.com/images/recliner1.jpg",
            "https://example.com/images/recliner2.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 23
        },
        "features": [
            "Leather upholstery",
            "Cushioned seat and backrest",
            "Smooth reclining mechanism"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "sofa"
    },
    {
        "_id": "6429ebadf2c14d2086e788c0",
        "title": "Sleeper Sofa",
        "brand": "Room & Board",
        "description": "Maximize your space with this stylish sleeper sofa. The sofa easily transforms into a comfortable bed, perfect for guests or small apartments.",
        "price": 1699.99,
        "discount": 11,
        "inStock": true,
        "soldBy": "Room & Board",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/51KN0gzYQGL.jpg",
            "https://m.media-amazon.com/images/I/61tsopJe6EL.jpg",
            "https://m.media-amazon.com/images/I/51QSPkjH8nL.jpg",
            "https://m.media-amazon.com/images/I/61lMRpUsZhL.jpg",
            "https://m.media-amazon.com/images/I/61lMRpUsZhL.jpg"
        ],
        "rating": {
            "rating": 3.7,
            "count": 47
        },
        "features": [
            "smooth & comfortable design",
            "specially designed for backrest",
            "solid wood with attractive design"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "sofa"
    },
    {
        "_id": "6429ebc6f2c14d2086e788c2",
        "title": "Eames Style Lounge Chair",
        "brand": "Manhattan Home Design",
        "description": "Relax in style with this iconic Eames style lounge chair. The chair features premium leather upholstery and a sleek modern design.",
        "price": 999.99,
        "discount": 29,
        "inStock": true,
        "soldBy": "Manhattan Home Design",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41FAFJmxncL.jpg",
            "https://m.media-amazon.com/images/I/51e7ev6BBFL.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 106
        },
        "features": [
            "Iconic Eames style",
            "Premium leather upholstery",
            "Sleek modern design"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "chair"
    },
    {
        "_id": "6429ebe4f2c14d2086e788c4",
        "title": "Sectional Sofa",
        "brand": "Bob's Discount Furniture",
        "description": "Make your living room the ultimate hangout spot with this spacious sectional sofa. The sofa features a comfortable chaise, multiple reclining seats, and soft fabric upholstery.",
        "price": 1499.99,
        "discount": 30,
        "inStock": true,
        "soldBy": "Bob's Discount Furniture",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41eKR84Q5PL.jpg",
            "https://m.media-amazon.com/images/I/41TH6dB0xRL.jpg",
            "https://m.media-amazon.com/images/I/31JPp6q0xWL.jpg"
        ],
        "rating": {
            "rating": 4.1,
            "count": 24
        },
        "features": [
            "Spacious sectional design",
            "Comfortable chaise",
            "Multiple reclining seats"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "sofa"
    },
    {
        "_id": "6429ec0df2c14d2086e788c6",
        "title": "Platform Bed Frame",
        "brand": "Modway",
        "description": "Create a minimalist and modern bedroom with this platform bed frame. The frame features a low-profile design, sturdy construction, and easy-to-assemble.",
        "price": 249.99,
        "discount": 12,
        "inStock": true,
        "soldBy": "Modway",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/812NHT44UkL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71ZDNP+RsDL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81xRZWDpQOL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91G1f2EoCWL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.4,
            "count": 19
        },
        "features": [
            "Minimalist and modern design",
            "Sturdy construction",
            "Easy-to-assemble"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "bed"
    },
    {
        "_id": "6429ec1cf2c14d2086e788c8",
        "title": "Armless Accent Chair",
        "brand": "HomePop",
        "description": "Add a pop of color and comfort to your living room with this armless accent chair. The chair features a soft fabric upholstery, sturdy wooden legs, and a contemporary design.",
        "price": 199.99,
        "discount": 25,
        "inStock": true,
        "soldBy": "HomePop",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41pQNZSpd6L.jpg",
            "https://m.media-amazon.com/images/I/41Z9tz7tlYL.jpg"
        ],
        "rating": {
            "rating": 4,
            "count": 15
        },
        "features": [
            "Soft fabric upholstery",
            "Sturdy wooden legs",
            "Contemporary design"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "chair"
    },
    {
        "_id": "6429ec32f2c14d2086e788ca",
        "title": "L-Shaped Sectional Sofa",
        "brand": "Modway",
        "description": "Create a comfortable and inviting seating area with this L-shaped sectional sofa. The sofa features a plush cushioning, a sturdy wooden frame, and a modern design.",
        "price": 1399.99,
        "discount": 29,
        "inStock": true,
        "soldBy": "Modway",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/612cYAERsDL._SL1000_.jpg",
            "https://m.media-amazon.com/images/I/61TOReTmmIL._SL1280_.jpg",
            "https://m.media-amazon.com/images/I/71A8umcLVcL._SL1280_.jpg",
            "https://m.media-amazon.com/images/I/519JMTyF5UL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.6,
            "count": 30
        },
        "features": [
            "Plush cushioning",
            "Sturdy wooden frame",
            "Modern design"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "sofa"
    },
    {
        "_id": "6429ec43f2c14d2086e788cc",
        "title": "Platform Bed",
        "brand": "Zinus",
        "description": "Create a minimalist bedroom with this platform bed. The bed features a sturdy metal frame, a sleek design, and a comfortable headboard.",
        "price": 279.99,
        "discount": 10,
        "inStock": true,
        "soldBy": "Zinus",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61T2Nui6mGL._SL1400_.jpg",
            "https://m.media-amazon.com/images/I/61AcveC0S+L._SL1400_.jpg",
            "https://m.media-amazon.com/images/I/61eYl9gy4SL._SL1400_.jpg",
            "https://m.media-amazon.com/images/I/71neC7Jj0KL._SL1400_.jpg"
        ],
        "rating": {
            "rating": 4.4,
            "count": 20
        },
        "features": [
            "Good space to store stuff",
            "solid wood as base material"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "bed"
    },
    {
        "_id": "6429ec56f2c14d2086e788ce",
        "title": "Accent Armchair",
        "brand": "HOMCOM",
        "description": "Add a touch of style to your living space with this comfortable accent armchair. The chair features soft fabric upholstery, a supportive backrest, and sturdy wooden legs.",
        "price": 179.99,
        "discount": 10,
        "inStock": true,
        "soldBy": "HOMCOM",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/41JzBJdt9zL.jpg",
            "https://m.media-amazon.com/images/I/41KJjUbWdhL.jpg"
        ],
        "rating": {
            "rating": 4,
            "count": 40
        },
        "features": [
            "Soft fabric upholstery",
            "Supportive backrest",
            "Sturdy wooden legs"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "chair"
    },
    {
        "_id": "6429ec72f2c14d2086e788d0",
        "title": "soft cushioning Sofa",
        "brand": "Bob's Discount Furniture",
        "description": "Create a comfortable and stylish living room with this sectional sofa. The sofa features soft cushioning, a durable hardwood frame, and a chaise for lounging.",
        "price": 1499.99,
        "discount": 18,
        "inStock": true,
        "soldBy": "Bob's Discount Furniture",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71Fv4xQjPwL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71Fv4xQjPwL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71V8L3dVvHL._SL1500_.jpg"
        ],
        "rating": {
            "rating": 4.7,
            "count": 43
        },
        "features": [
            "Soft cushioning",
            "Durable hardwood frame",
            "Chaise for lounging"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "sofa"
    },
    {
        "_id": "6429ec87f2c14d2086e788d2",
        "title": "King Size Bed Frame",
        "brand": "Zinus",
        "description": "Sleep in comfort and style with this king size bed frame. The frame features a classic design, sturdy construction, and easy-to-assemble.",
        "price": 299.99,
        "discount": 38,
        "inStock": true,
        "soldBy": "Zinus",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/61HcqU1ZFFL._SL1000_.jpg",
            "https://m.media-amazon.com/images/I/61HcqU1ZFFL._SL1000_.jpg",
            "https://m.media-amazon.com/images/I/61Qg+bpAKyL._SL1000_.jpg",
            "https://m.media-amazon.com/images/I/514kpn04JqL._SL1000_.jpg"
        ],
        "rating": {
            "rating": 4.6,
            "count": 28
        },
        "features": [
            "Classic design",
            "Sturdy construction",
            "Easy-to-assemble"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "bed"
    },
    {
        "_id": "6429ecf4f2c14d2086e788d4",
        "title": "Dining Chair Set",
        "brand": "Modway",
        "description": "Upgrade your dining room with this stylish and comfortable chair set. The set includes four chairs with a sturdy metal frame and upholstered seats and backs.",
        "price": 249.99,
        "discount": 10,
        "inStock": true,
        "soldBy": "Modway",
        "imageUrls": [
            "https://m.media-amazon.com/images/I/71YpnEZ+8OL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61h0pSRFWrL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61h0pSRFWrL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61MKf+mXr2L._SL1500_.jpg"
        ],
        "rating": {
            "rating": 2.9,
            "count": 15
        },
        "features": [
            "Leather upholstery",
            "Solid wood frame",
            "Foam cushioning"
        ],
        "offers": [
            "EMI on debit cards is currently available for select customers of following banks:HDFC, ICICI, Axis, Kotak Mahindra and Federal Bank on products above Rs.5,000. To know more about Debit EMI eligibility and how it works",
            "10% Instant Discount up to INR 500 on IDBI Bank Card Trxns. Min purchase value INR 2000",
            "5% Instant Discount up to INR 250 on HSBC Cashback Card Credit Card Transactions. Minimum purchase value INR 1000",
            "Saving up to 28% off with GST input credit"
        ],
        "category": "furnitures",
        "subCategory": "dining table"
    }
]